TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                 Unix v15.12.1.LTS *
       3              ;* Date/Time created: Wed Jun 29 07:17:38 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DSP2803x_GlobalVariableDefs.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen Unix v15.12.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/kuotungtsai/controlSUITE/development_kits/HVMotorCtrl+PfcKit
      13                      .global _EmuKey
      14 00000000       _EmuKey:        .usect  "EmuKeyVar",1,0,0
      15              $C$DW$1 .dwtag  DW_TAG_variable
      16                      .dwattr $C$DW$1, DW_AT_name("EmuKey")

     346                      .global _GpioCtrlRegs
     347 00000000       _GpioCtrlRegs:  .usect  "GpioCtrlRegsFile",64,1,1
     348              $C$DW$38        .dwtag  DW_TAG_variable
     349                      .dwattr $C$DW$38, DW_AT_name("GpioCtrlRegs")
     350                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_GpioCtrlRegs")
     351                      .dwattr $C$DW$38, DW_AT_location[DW_OP_addr _GpioCtrlRegs]
     352                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$473)
     353                      .dwattr $C$DW$38, DW_AT_external
     354              
     355                      .global _EPwm5Regs
     356 00000000       _EPwm5Regs:     .usect  "EPwm5RegsFile",64,1,1
     357              $C$DW$39        .dwtag  DW_TAG_variable
     358                      .dwattr $C$DW$39, DW_AT_name("EPwm5Regs")
     359                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_EPwm5Regs")
     360                      .dwattr $C$DW$39, DW_AT_location[DW_OP_addr _EPwm5Regs]
     361                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$470)
     362                      .dwattr $C$DW$39, DW_AT_external
     363              
     364                      .global _EQep1Regs
     365 00000000       _EQep1Regs:     .usect  "EQep1RegsFile",64,1,1
     366              $C$DW$40        .dwtag  DW_TAG_variable
     367                      .dwattr $C$DW$40, DW_AT_name("EQep1Regs")
     368                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_EQep1Regs")
     369                      .dwattr $C$DW$40, DW_AT_location[DW_OP_addr _EQep1Regs]
     370                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$471)
     371                      .dwattr $C$DW$40, DW_AT_external
     372              
     373                      .global _ECanaMOTORegs
     374 00000000       _ECanaMOTORegs: .usect  "ECanaMOTORegsFile",64,1,1
     375              $C$DW$41        .dwtag  DW_TAG_variable
     376                      .dwattr $C$DW$41, DW_AT_name("ECanaMOTORegs")
     377                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_ECanaMOTORegs")
     378                      .dwattr $C$DW$41, DW_AT_location[DW_OP_addr _ECanaMOTORegs]
     379                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$479)
     380                      .dwattr $C$DW$41, DW_AT_external
     381              
     382                      .global _LinaRegs
     383 00000000       _LinaRegs:      .usect  "LinaRegsFile",74,1,1
     384              $C$DW$42        .dwtag  DW_TAG_variable
     385                      .dwattr $C$DW$42, DW_AT_name("LinaRegs")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE    8

     386                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_LinaRegs")
     387                      .dwattr $C$DW$42, DW_AT_location[DW_OP_addr _LinaRegs]
     388                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$478)
     389                      .dwattr $C$DW$42, DW_AT_external
     390              
     391                      .global _AdcRegs
     392 00000000       _AdcRegs:       .usect  "AdcRegsFile",80,1,0
     393              $C$DW$43        .dwtag  DW_TAG_variable
     394                      .dwattr $C$DW$43, DW_AT_name("AdcRegs")
     395                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_AdcRegs")
     396                      .dwattr $C$DW$43, DW_AT_location[DW_OP_addr _AdcRegs]
     397                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$459)
     398                      .dwattr $C$DW$43, DW_AT_external
     399              
     400                      .global _PieVectTable
     401 00000000       _PieVectTable:  .usect  "PieVectTableFile",256,1,1
     402              $C$DW$44        .dwtag  DW_TAG_variable
     403                      .dwattr $C$DW$44, DW_AT_name("PieVectTable")
     404                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_PieVectTable")
     405                      .dwattr $C$DW$44, DW_AT_location[DW_OP_addr _PieVectTable]
     406                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$340)
     407                      .dwattr $C$DW$44, DW_AT_external
     408              
     409                      .global _ECanaMboxes
     410 00000000       _ECanaMboxes:   .usect  "ECanaMboxesFile",256,1,1
     411              $C$DW$45        .dwtag  DW_TAG_variable
     412                      .dwattr $C$DW$45, DW_AT_name("ECanaMboxes")
     413                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_ECanaMboxes")
     414                      .dwattr $C$DW$45, DW_AT_location[DW_OP_addr _ECanaMboxes]
     415                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$467)
     416                      .dwattr $C$DW$45, DW_AT_external
     417              
     418              ;       /Applications/ti/ccsv6/tools/compiler/ti-cgt-c2000_15.12.1.LTS/bin/ac2000 -@/var/tmp/24362e0sJui 
     419              
     420              ;***************************************************************
     421              ;* TYPE INFORMATION                                            *
     422              ;***************************************************************
     423              
     424              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     425                      .dwattr $C$DW$T$20, DW_AT_name("ADCCTL1_BITS")
     426                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     427              $C$DW$46        .dwtag  DW_TAG_member
     428                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     429                      .dwattr $C$DW$46, DW_AT_name("TEMPCONV")
     430                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_TEMPCONV")
     431                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0f)
     432                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     433                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     434                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     435              
     436              $C$DW$47        .dwtag  DW_TAG_member
     437                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     438                      .dwattr $C$DW$47, DW_AT_name("VREFLOCONV")
     439                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_VREFLOCONV")
     440                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE    9

     441                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     442                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     443                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     444              
     445              $C$DW$48        .dwtag  DW_TAG_member
     446                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     447                      .dwattr $C$DW$48, DW_AT_name("INTPULSEPOS")
     448                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_INTPULSEPOS")
     449                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0d)
     450                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     451                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     452                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     453              
     454              $C$DW$49        .dwtag  DW_TAG_member
     455                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     456                      .dwattr $C$DW$49, DW_AT_name("ADCREFSEL")
     457                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_ADCREFSEL")
     458                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0c)
     459                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     460                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     461                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     462              
     463              $C$DW$50        .dwtag  DW_TAG_member
     464                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     465                      .dwattr $C$DW$50, DW_AT_name("rsvd1")
     466                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd1")
     467                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0b)
     468                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     469                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     470                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     471              
     472              $C$DW$51        .dwtag  DW_TAG_member
     473                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     474                      .dwattr $C$DW$51, DW_AT_name("ADCREFPWD")
     475                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_ADCREFPWD")
     476                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0a)
     477                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     478                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     479                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     480              
     481              $C$DW$52        .dwtag  DW_TAG_member
     482                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     483                      .dwattr $C$DW$52, DW_AT_name("ADCBGPWD")
     484                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_ADCBGPWD")
     485                      .dwattr $C$DW$52, DW_AT_bit_offset(0x09)
     486                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     487                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     488                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     489              
     490              $C$DW$53        .dwtag  DW_TAG_member
     491                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     492                      .dwattr $C$DW$53, DW_AT_name("ADCPWDN")
     493                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_ADCPWDN")
     494                      .dwattr $C$DW$53, DW_AT_bit_offset(0x08)
     495                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   10

     496                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     497                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     498              
     499              $C$DW$54        .dwtag  DW_TAG_member
     500                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     501                      .dwattr $C$DW$54, DW_AT_name("ADCBSYCHN")
     502                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_ADCBSYCHN")
     503                      .dwattr $C$DW$54, DW_AT_bit_offset(0x03)
     504                      .dwattr $C$DW$54, DW_AT_bit_size(0x05)
     505                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     506                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     507              
     508              $C$DW$55        .dwtag  DW_TAG_member
     509                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     510                      .dwattr $C$DW$55, DW_AT_name("ADCBSY")
     511                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_ADCBSY")
     512                      .dwattr $C$DW$55, DW_AT_bit_offset(0x02)
     513                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     514                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     515                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     516              
     517              $C$DW$56        .dwtag  DW_TAG_member
     518                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     519                      .dwattr $C$DW$56, DW_AT_name("ADCENABLE")
     520                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_ADCENABLE")
     521                      .dwattr $C$DW$56, DW_AT_bit_offset(0x01)
     522                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     523                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     524                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     525              
     526              $C$DW$57        .dwtag  DW_TAG_member
     527                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     528                      .dwattr $C$DW$57, DW_AT_name("RESET")
     529                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_RESET")
     530                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00)
     531                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     532                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     533                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     534              
     535                      .dwendtag $C$DW$T$20
     536              
     537              
     538              $C$DW$T$21      .dwtag  DW_TAG_union_type
     539                      .dwattr $C$DW$T$21, DW_AT_name("ADCCTL1_REG")
     540                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     541              $C$DW$58        .dwtag  DW_TAG_member
     542                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     543                      .dwattr $C$DW$58, DW_AT_name("all")
     544                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_all")
     545                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     546                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     547              
     548              $C$DW$59        .dwtag  DW_TAG_member
     549                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$20)
     550                      .dwattr $C$DW$59, DW_AT_name("bit")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   11

     551                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_bit")
     552                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     553                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     554              
     555                      .dwendtag $C$DW$T$21
     556              
     557              
     558              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     559                      .dwattr $C$DW$T$22, DW_AT_name("ADCCTL2_BITS")
     560                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     561              $C$DW$60        .dwtag  DW_TAG_member
     562                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     563                      .dwattr $C$DW$60, DW_AT_name("CLKDIV2EN")
     564                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_CLKDIV2EN")
     565                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0f)
     566                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     567                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     568                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     569              
     570              $C$DW$61        .dwtag  DW_TAG_member
     571                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     572                      .dwattr $C$DW$61, DW_AT_name("ADCNONOVERLAP")
     573                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_ADCNONOVERLAP")
     574                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0e)
     575                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     576                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     577                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     578              
     579              $C$DW$62        .dwtag  DW_TAG_member
     580                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     581                      .dwattr $C$DW$62, DW_AT_name("rsvd1")
     582                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_rsvd1")
     583                      .dwattr $C$DW$62, DW_AT_bit_offset(0x00)
     584                      .dwattr $C$DW$62, DW_AT_bit_size(0x0e)
     585                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     586                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     587              
     588                      .dwendtag $C$DW$T$22
     589              
     590              
     591              $C$DW$T$23      .dwtag  DW_TAG_union_type
     592                      .dwattr $C$DW$T$23, DW_AT_name("ADCCTL2_REG")
     593                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     594              $C$DW$63        .dwtag  DW_TAG_member
     595                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     596                      .dwattr $C$DW$63, DW_AT_name("all")
     597                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_all")
     598                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     599                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     600              
     601              $C$DW$64        .dwtag  DW_TAG_member
     602                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$22)
     603                      .dwattr $C$DW$64, DW_AT_name("bit")
     604                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_bit")
     605                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   12

     606                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     607              
     608                      .dwendtag $C$DW$T$23
     609              
     610              
     611              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     612                      .dwattr $C$DW$T$24, DW_AT_name("ADCINTSOCSEL1_BITS")
     613                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     614              $C$DW$65        .dwtag  DW_TAG_member
     615                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     616                      .dwattr $C$DW$65, DW_AT_name("SOC0")
     617                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_SOC0")
     618                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0e)
     619                      .dwattr $C$DW$65, DW_AT_bit_size(0x02)
     620                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     621                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     622              
     623              $C$DW$66        .dwtag  DW_TAG_member
     624                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     625                      .dwattr $C$DW$66, DW_AT_name("SOC1")
     626                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_SOC1")
     627                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0c)
     628                      .dwattr $C$DW$66, DW_AT_bit_size(0x02)
     629                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     631              
     632              $C$DW$67        .dwtag  DW_TAG_member
     633                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     634                      .dwattr $C$DW$67, DW_AT_name("SOC2")
     635                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_SOC2")
     636                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0a)
     637                      .dwattr $C$DW$67, DW_AT_bit_size(0x02)
     638                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     639                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     640              
     641              $C$DW$68        .dwtag  DW_TAG_member
     642                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     643                      .dwattr $C$DW$68, DW_AT_name("SOC3")
     644                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_SOC3")
     645                      .dwattr $C$DW$68, DW_AT_bit_offset(0x08)
     646                      .dwattr $C$DW$68, DW_AT_bit_size(0x02)
     647                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     648                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     649              
     650              $C$DW$69        .dwtag  DW_TAG_member
     651                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     652                      .dwattr $C$DW$69, DW_AT_name("SOC4")
     653                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_SOC4")
     654                      .dwattr $C$DW$69, DW_AT_bit_offset(0x06)
     655                      .dwattr $C$DW$69, DW_AT_bit_size(0x02)
     656                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     657                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     658              
     659              $C$DW$70        .dwtag  DW_TAG_member
     660                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   13

     661                      .dwattr $C$DW$70, DW_AT_name("SOC5")
     662                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_SOC5")
     663                      .dwattr $C$DW$70, DW_AT_bit_offset(0x04)
     664                      .dwattr $C$DW$70, DW_AT_bit_size(0x02)
     665                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     666                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     667              
     668              $C$DW$71        .dwtag  DW_TAG_member
     669                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     670                      .dwattr $C$DW$71, DW_AT_name("SOC6")
     671                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_SOC6")
     672                      .dwattr $C$DW$71, DW_AT_bit_offset(0x02)
     673                      .dwattr $C$DW$71, DW_AT_bit_size(0x02)
     674                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     675                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     676              
     677              $C$DW$72        .dwtag  DW_TAG_member
     678                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     679                      .dwattr $C$DW$72, DW_AT_name("SOC7")
     680                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_SOC7")
     681                      .dwattr $C$DW$72, DW_AT_bit_offset(0x00)
     682                      .dwattr $C$DW$72, DW_AT_bit_size(0x02)
     683                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     684                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     685              
     686                      .dwendtag $C$DW$T$24
     687              
     688              
     689              $C$DW$T$25      .dwtag  DW_TAG_union_type
     690                      .dwattr $C$DW$T$25, DW_AT_name("ADCINTSOCSEL1_REG")
     691                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     692              $C$DW$73        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     694                      .dwattr $C$DW$73, DW_AT_name("all")
     695                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_all")
     696                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     698              
     699              $C$DW$74        .dwtag  DW_TAG_member
     700                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$24)
     701                      .dwattr $C$DW$74, DW_AT_name("bit")
     702                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_bit")
     703                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     704                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     705              
     706                      .dwendtag $C$DW$T$25
     707              
     708              
     709              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     710                      .dwattr $C$DW$T$26, DW_AT_name("ADCINTSOCSEL2_BITS")
     711                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     712              $C$DW$75        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     714                      .dwattr $C$DW$75, DW_AT_name("SOC8")
     715                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_SOC8")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   14

     716                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0e)
     717                      .dwattr $C$DW$75, DW_AT_bit_size(0x02)
     718                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     719                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     720              
     721              $C$DW$76        .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     723                      .dwattr $C$DW$76, DW_AT_name("SOC9")
     724                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_SOC9")
     725                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0c)
     726                      .dwattr $C$DW$76, DW_AT_bit_size(0x02)
     727                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     728                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     729              
     730              $C$DW$77        .dwtag  DW_TAG_member
     731                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     732                      .dwattr $C$DW$77, DW_AT_name("SOC10")
     733                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_SOC10")
     734                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0a)
     735                      .dwattr $C$DW$77, DW_AT_bit_size(0x02)
     736                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     737                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     738              
     739              $C$DW$78        .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     741                      .dwattr $C$DW$78, DW_AT_name("SOC11")
     742                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_SOC11")
     743                      .dwattr $C$DW$78, DW_AT_bit_offset(0x08)
     744                      .dwattr $C$DW$78, DW_AT_bit_size(0x02)
     745                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     746                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     747              
     748              $C$DW$79        .dwtag  DW_TAG_member
     749                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     750                      .dwattr $C$DW$79, DW_AT_name("SOC12")
     751                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_SOC12")
     752                      .dwattr $C$DW$79, DW_AT_bit_offset(0x06)
     753                      .dwattr $C$DW$79, DW_AT_bit_size(0x02)
     754                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     755                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     756              
     757              $C$DW$80        .dwtag  DW_TAG_member
     758                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     759                      .dwattr $C$DW$80, DW_AT_name("SOC13")
     760                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_SOC13")
     761                      .dwattr $C$DW$80, DW_AT_bit_offset(0x04)
     762                      .dwattr $C$DW$80, DW_AT_bit_size(0x02)
     763                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     765              
     766              $C$DW$81        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$81, DW_AT_name("SOC14")
     769                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_SOC14")
     770                      .dwattr $C$DW$81, DW_AT_bit_offset(0x02)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   15

     771                      .dwattr $C$DW$81, DW_AT_bit_size(0x02)
     772                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     773                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     774              
     775              $C$DW$82        .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     777                      .dwattr $C$DW$82, DW_AT_name("SOC15")
     778                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_SOC15")
     779                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
     780                      .dwattr $C$DW$82, DW_AT_bit_size(0x02)
     781                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     782                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     783              
     784                      .dwendtag $C$DW$T$26
     785              
     786              
     787              $C$DW$T$27      .dwtag  DW_TAG_union_type
     788                      .dwattr $C$DW$T$27, DW_AT_name("ADCINTSOCSEL2_REG")
     789                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     790              $C$DW$83        .dwtag  DW_TAG_member
     791                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     792                      .dwattr $C$DW$83, DW_AT_name("all")
     793                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_all")
     794                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     795                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     796              
     797              $C$DW$84        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$26)
     799                      .dwattr $C$DW$84, DW_AT_name("bit")
     800                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_bit")
     801                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     803              
     804                      .dwendtag $C$DW$T$27
     805              
     806              
     807              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     808                      .dwattr $C$DW$T$28, DW_AT_name("ADCINT_BITS")
     809                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     810              $C$DW$85        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$85, DW_AT_name("ADCINT1")
     813                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_ADCINT1")
     814                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0f)
     815                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
     816                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     818              
     819              $C$DW$86        .dwtag  DW_TAG_member
     820                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     821                      .dwattr $C$DW$86, DW_AT_name("ADCINT2")
     822                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_ADCINT2")
     823                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0e)
     824                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
     825                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   16

     826                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     827              
     828              $C$DW$87        .dwtag  DW_TAG_member
     829                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     830                      .dwattr $C$DW$87, DW_AT_name("ADCINT3")
     831                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_ADCINT3")
     832                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0d)
     833                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
     834                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     835                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     836              
     837              $C$DW$88        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     839                      .dwattr $C$DW$88, DW_AT_name("ADCINT4")
     840                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ADCINT4")
     841                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0c)
     842                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
     843                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     844                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     845              
     846              $C$DW$89        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$89, DW_AT_name("ADCINT5")
     849                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ADCINT5")
     850                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0b)
     851                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
     852                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     853                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     854              
     855              $C$DW$90        .dwtag  DW_TAG_member
     856                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     857                      .dwattr $C$DW$90, DW_AT_name("ADCINT6")
     858                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_ADCINT6")
     859                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0a)
     860                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
     861                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     863              
     864              $C$DW$91        .dwtag  DW_TAG_member
     865                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     866                      .dwattr $C$DW$91, DW_AT_name("ADCINT7")
     867                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ADCINT7")
     868                      .dwattr $C$DW$91, DW_AT_bit_offset(0x09)
     869                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
     870                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     871                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     872              
     873              $C$DW$92        .dwtag  DW_TAG_member
     874                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     875                      .dwattr $C$DW$92, DW_AT_name("ADCINT8")
     876                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_ADCINT8")
     877                      .dwattr $C$DW$92, DW_AT_bit_offset(0x08)
     878                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
     879                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     880                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   17

     881              
     882              $C$DW$93        .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     884                      .dwattr $C$DW$93, DW_AT_name("ADCINT9")
     885                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_ADCINT9")
     886                      .dwattr $C$DW$93, DW_AT_bit_offset(0x07)
     887                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
     888                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     889                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     890              
     891              $C$DW$94        .dwtag  DW_TAG_member
     892                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     893                      .dwattr $C$DW$94, DW_AT_name("rsvd1")
     894                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd1")
     895                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00)
     896                      .dwattr $C$DW$94, DW_AT_bit_size(0x07)
     897                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     898                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     899              
     900                      .dwendtag $C$DW$T$28
     901              
     902              
     903              $C$DW$T$29      .dwtag  DW_TAG_union_type
     904                      .dwattr $C$DW$T$29, DW_AT_name("ADCINT_REG")
     905                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     906              $C$DW$95        .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     908                      .dwattr $C$DW$95, DW_AT_name("all")
     909                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
     910                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     911                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     912              
     913              $C$DW$96        .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$28)
     915                      .dwattr $C$DW$96, DW_AT_name("bit")
     916                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
     917                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     918                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     919              
     920                      .dwendtag $C$DW$T$29
     921              
     922              
     923              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     924                      .dwattr $C$DW$T$31, DW_AT_name("ADCOFFTRIM_BITS")
     925                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     926              $C$DW$97        .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$30)
     928                      .dwattr $C$DW$97, DW_AT_name("OFFTRIM")
     929                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_OFFTRIM")
     930                      .dwattr $C$DW$97, DW_AT_bit_offset(0x07)
     931                      .dwattr $C$DW$97, DW_AT_bit_size(0x09)
     932                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     933                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     934              
     935              $C$DW$98        .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   18

     936                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     937                      .dwattr $C$DW$98, DW_AT_name("rsvd1")
     938                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd1")
     939                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00)
     940                      .dwattr $C$DW$98, DW_AT_bit_size(0x07)
     941                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     943              
     944                      .dwendtag $C$DW$T$31
     945              
     946              
     947              $C$DW$T$32      .dwtag  DW_TAG_union_type
     948                      .dwattr $C$DW$T$32, DW_AT_name("ADCOFFTRIM_REG")
     949                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     950              $C$DW$99        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     952                      .dwattr $C$DW$99, DW_AT_name("all")
     953                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_all")
     954                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     956              
     957              $C$DW$100       .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$31)
     959                      .dwattr $C$DW$100, DW_AT_name("bit")
     960                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_bit")
     961                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     962                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     963              
     964                      .dwendtag $C$DW$T$32
     965              
     966              
     967              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     968                      .dwattr $C$DW$T$33, DW_AT_name("ADCREFTRIM_BITS")
     969                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     970              $C$DW$101       .dwtag  DW_TAG_member
     971                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     972                      .dwattr $C$DW$101, DW_AT_name("BG_FINE_TRIM")
     973                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_BG_FINE_TRIM")
     974                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0b)
     975                      .dwattr $C$DW$101, DW_AT_bit_size(0x05)
     976                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     977                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     978              
     979              $C$DW$102       .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     981                      .dwattr $C$DW$102, DW_AT_name("BG_COARSE_TRIM")
     982                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_BG_COARSE_TRIM")
     983                      .dwattr $C$DW$102, DW_AT_bit_offset(0x07)
     984                      .dwattr $C$DW$102, DW_AT_bit_size(0x04)
     985                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     986                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     987              
     988              $C$DW$103       .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     990                      .dwattr $C$DW$103, DW_AT_name("EXTREF_FINE_TRIM")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   19

     991                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_EXTREF_FINE_TRIM")
     992                      .dwattr $C$DW$103, DW_AT_bit_offset(0x02)
     993                      .dwattr $C$DW$103, DW_AT_bit_size(0x05)
     994                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     996              
     997              $C$DW$104       .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     999                      .dwattr $C$DW$104, DW_AT_name("rsvd1")
    1000                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd1")
    1001                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1002                      .dwattr $C$DW$104, DW_AT_bit_size(0x02)
    1003                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1004                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1005              
    1006                      .dwendtag $C$DW$T$33
    1007              
    1008              
    1009              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1010                      .dwattr $C$DW$T$34, DW_AT_name("ADCREFTRIM_REG")
    1011                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1012              $C$DW$105       .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1014                      .dwattr $C$DW$105, DW_AT_name("all")
    1015                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_all")
    1016                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1018              
    1019              $C$DW$106       .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$33)
    1021                      .dwattr $C$DW$106, DW_AT_name("bit")
    1022                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_bit")
    1023                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1025              
    1026                      .dwendtag $C$DW$T$34
    1027              
    1028              
    1029              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1030                      .dwattr $C$DW$T$35, DW_AT_name("ADCSAMPLEMODE_BITS")
    1031                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1032              $C$DW$107       .dwtag  DW_TAG_member
    1033                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1034                      .dwattr $C$DW$107, DW_AT_name("SIMULEN0")
    1035                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_SIMULEN0")
    1036                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0f)
    1037                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1038                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1039                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1040              
    1041              $C$DW$108       .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1043                      .dwattr $C$DW$108, DW_AT_name("SIMULEN2")
    1044                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_SIMULEN2")
    1045                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   20

    1046                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1047                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1048                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1049              
    1050              $C$DW$109       .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1052                      .dwattr $C$DW$109, DW_AT_name("SIMULEN4")
    1053                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_SIMULEN4")
    1054                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0d)
    1055                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1056                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1057                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1058              
    1059              $C$DW$110       .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1061                      .dwattr $C$DW$110, DW_AT_name("SIMULEN6")
    1062                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_SIMULEN6")
    1063                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0c)
    1064                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1065                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1066                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1067              
    1068              $C$DW$111       .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1070                      .dwattr $C$DW$111, DW_AT_name("SIMULEN8")
    1071                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_SIMULEN8")
    1072                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0b)
    1073                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1074                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1075                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1076              
    1077              $C$DW$112       .dwtag  DW_TAG_member
    1078                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1079                      .dwattr $C$DW$112, DW_AT_name("SIMULEN10")
    1080                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_SIMULEN10")
    1081                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0a)
    1082                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1083                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1084                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1085              
    1086              $C$DW$113       .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1088                      .dwattr $C$DW$113, DW_AT_name("SIMULEN12")
    1089                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_SIMULEN12")
    1090                      .dwattr $C$DW$113, DW_AT_bit_offset(0x09)
    1091                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1092                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1093                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1094              
    1095              $C$DW$114       .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1097                      .dwattr $C$DW$114, DW_AT_name("SIMULEN14")
    1098                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_SIMULEN14")
    1099                      .dwattr $C$DW$114, DW_AT_bit_offset(0x08)
    1100                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   21

    1101                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1102                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1103              
    1104              $C$DW$115       .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1106                      .dwattr $C$DW$115, DW_AT_name("rsvd1")
    1107                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd1")
    1108                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
    1109                      .dwattr $C$DW$115, DW_AT_bit_size(0x08)
    1110                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1111                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1112              
    1113                      .dwendtag $C$DW$T$35
    1114              
    1115              
    1116              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1117                      .dwattr $C$DW$T$36, DW_AT_name("ADCSAMPLEMODE_REG")
    1118                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1119              $C$DW$116       .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1121                      .dwattr $C$DW$116, DW_AT_name("all")
    1122                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_all")
    1123                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1124                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1125              
    1126              $C$DW$117       .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$35)
    1128                      .dwattr $C$DW$117, DW_AT_name("bit")
    1129                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_bit")
    1130                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1132              
    1133                      .dwendtag $C$DW$T$36
    1134              
    1135              
    1136              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1137                      .dwattr $C$DW$T$37, DW_AT_name("ADCSOC_BITS")
    1138                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1139              $C$DW$118       .dwtag  DW_TAG_member
    1140                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1141                      .dwattr $C$DW$118, DW_AT_name("SOC0")
    1142                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_SOC0")
    1143                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0f)
    1144                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1145                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1146                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1147              
    1148              $C$DW$119       .dwtag  DW_TAG_member
    1149                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1150                      .dwattr $C$DW$119, DW_AT_name("SOC1")
    1151                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_SOC1")
    1152                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0e)
    1153                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1154                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1155                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   22

    1156              
    1157              $C$DW$120       .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1159                      .dwattr $C$DW$120, DW_AT_name("SOC2")
    1160                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_SOC2")
    1161                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0d)
    1162                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1163                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1165              
    1166              $C$DW$121       .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1168                      .dwattr $C$DW$121, DW_AT_name("SOC3")
    1169                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_SOC3")
    1170                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0c)
    1171                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1172                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1173                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1174              
    1175              $C$DW$122       .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1177                      .dwattr $C$DW$122, DW_AT_name("SOC4")
    1178                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_SOC4")
    1179                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0b)
    1180                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1181                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1182                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1183              
    1184              $C$DW$123       .dwtag  DW_TAG_member
    1185                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1186                      .dwattr $C$DW$123, DW_AT_name("SOC5")
    1187                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_SOC5")
    1188                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0a)
    1189                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1190                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1191                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1192              
    1193              $C$DW$124       .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1195                      .dwattr $C$DW$124, DW_AT_name("SOC6")
    1196                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_SOC6")
    1197                      .dwattr $C$DW$124, DW_AT_bit_offset(0x09)
    1198                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1199                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1200                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1201              
    1202              $C$DW$125       .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1204                      .dwattr $C$DW$125, DW_AT_name("SOC7")
    1205                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_SOC7")
    1206                      .dwattr $C$DW$125, DW_AT_bit_offset(0x08)
    1207                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1208                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1209                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1210              
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   23

    1211              $C$DW$126       .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1213                      .dwattr $C$DW$126, DW_AT_name("SOC8")
    1214                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_SOC8")
    1215                      .dwattr $C$DW$126, DW_AT_bit_offset(0x07)
    1216                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1217                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1219              
    1220              $C$DW$127       .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1222                      .dwattr $C$DW$127, DW_AT_name("SOC9")
    1223                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_SOC9")
    1224                      .dwattr $C$DW$127, DW_AT_bit_offset(0x06)
    1225                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1226                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1228              
    1229              $C$DW$128       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1231                      .dwattr $C$DW$128, DW_AT_name("SOC10")
    1232                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_SOC10")
    1233                      .dwattr $C$DW$128, DW_AT_bit_offset(0x05)
    1234                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1235                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1237              
    1238              $C$DW$129       .dwtag  DW_TAG_member
    1239                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1240                      .dwattr $C$DW$129, DW_AT_name("SOC11")
    1241                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_SOC11")
    1242                      .dwattr $C$DW$129, DW_AT_bit_offset(0x04)
    1243                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1244                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1246              
    1247              $C$DW$130       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1249                      .dwattr $C$DW$130, DW_AT_name("SOC12")
    1250                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_SOC12")
    1251                      .dwattr $C$DW$130, DW_AT_bit_offset(0x03)
    1252                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1253                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1254                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1255              
    1256              $C$DW$131       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1258                      .dwattr $C$DW$131, DW_AT_name("SOC13")
    1259                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_SOC13")
    1260                      .dwattr $C$DW$131, DW_AT_bit_offset(0x02)
    1261                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1262                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1263                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1264              
    1265              $C$DW$132       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   24

    1266                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1267                      .dwattr $C$DW$132, DW_AT_name("SOC14")
    1268                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_SOC14")
    1269                      .dwattr $C$DW$132, DW_AT_bit_offset(0x01)
    1270                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1271                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1272                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1273              
    1274              $C$DW$133       .dwtag  DW_TAG_member
    1275                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1276                      .dwattr $C$DW$133, DW_AT_name("SOC15")
    1277                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_SOC15")
    1278                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00)
    1279                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1280                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1281                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1282              
    1283                      .dwendtag $C$DW$T$37
    1284              
    1285              
    1286              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1287                      .dwattr $C$DW$T$38, DW_AT_name("ADCSOC_REG")
    1288                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1289              $C$DW$134       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1291                      .dwattr $C$DW$134, DW_AT_name("all")
    1292                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_all")
    1293                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1295              
    1296              $C$DW$135       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$37)
    1298                      .dwattr $C$DW$135, DW_AT_name("bit")
    1299                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_bit")
    1300                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1301                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1302              
    1303                      .dwendtag $C$DW$T$38
    1304              
    1305              
    1306              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1307                      .dwattr $C$DW$T$39, DW_AT_name("ADCSOCxCTL_BITS")
    1308                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1309              $C$DW$136       .dwtag  DW_TAG_member
    1310                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1311                      .dwattr $C$DW$136, DW_AT_name("ACQPS")
    1312                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ACQPS")
    1313                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0a)
    1314                      .dwattr $C$DW$136, DW_AT_bit_size(0x06)
    1315                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1316                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1317              
    1318              $C$DW$137       .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1320                      .dwattr $C$DW$137, DW_AT_name("CHSEL")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   25

    1321                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_CHSEL")
    1322                      .dwattr $C$DW$137, DW_AT_bit_offset(0x06)
    1323                      .dwattr $C$DW$137, DW_AT_bit_size(0x04)
    1324                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1326              
    1327              $C$DW$138       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$138, DW_AT_name("rsvd1")
    1330                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd1")
    1331                      .dwattr $C$DW$138, DW_AT_bit_offset(0x05)
    1332                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1333                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1334                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1335              
    1336              $C$DW$139       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1338                      .dwattr $C$DW$139, DW_AT_name("TRIGSEL")
    1339                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_TRIGSEL")
    1340                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1341                      .dwattr $C$DW$139, DW_AT_bit_size(0x05)
    1342                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1343                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1344              
    1345                      .dwendtag $C$DW$T$39
    1346              
    1347              
    1348              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1349                      .dwattr $C$DW$T$40, DW_AT_name("ADCSOCxCTL_REG")
    1350                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1351              $C$DW$140       .dwtag  DW_TAG_member
    1352                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1353                      .dwattr $C$DW$140, DW_AT_name("all")
    1354                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1355                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1356                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1357              
    1358              $C$DW$141       .dwtag  DW_TAG_member
    1359                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$39)
    1360                      .dwattr $C$DW$141, DW_AT_name("bit")
    1361                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1362                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1363                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1364              
    1365                      .dwendtag $C$DW$T$40
    1366              
    1367              
    1368              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1369                      .dwattr $C$DW$T$45, DW_AT_name("ADC_REGS")
    1370                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x50)
    1371              $C$DW$142       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$21)
    1373                      .dwattr $C$DW$142, DW_AT_name("ADCCTL1")
    1374                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ADCCTL1")
    1375                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   26

    1376                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1377              
    1378              $C$DW$143       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$23)
    1380                      .dwattr $C$DW$143, DW_AT_name("ADCCTL2")
    1381                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ADCCTL2")
    1382                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1383                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1384              
    1385              $C$DW$144       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$41)
    1387                      .dwattr $C$DW$144, DW_AT_name("rsvd1")
    1388                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd1")
    1389                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1390                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1391              
    1392              $C$DW$145       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$29)
    1394                      .dwattr $C$DW$145, DW_AT_name("ADCINTFLG")
    1395                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCINTFLG")
    1396                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1397                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1398              
    1399              $C$DW$146       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$29)
    1401                      .dwattr $C$DW$146, DW_AT_name("ADCINTFLGCLR")
    1402                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    1403                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1404                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1405              
    1406              $C$DW$147       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$29)
    1408                      .dwattr $C$DW$147, DW_AT_name("ADCINTOVF")
    1409                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCINTOVF")
    1410                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1411                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$148       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$29)
    1415                      .dwattr $C$DW$148, DW_AT_name("ADCINTOVFCLR")
    1416                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    1417                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1418                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1419              
    1420              $C$DW$149       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$252)
    1422                      .dwattr $C$DW$149, DW_AT_name("INTSEL1N2")
    1423                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_INTSEL1N2")
    1424                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1425                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1426              
    1427              $C$DW$150       .dwtag  DW_TAG_member
    1428                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$254)
    1429                      .dwattr $C$DW$150, DW_AT_name("INTSEL3N4")
    1430                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_INTSEL3N4")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   27

    1431                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1432                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1433              
    1434              $C$DW$151       .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$256)
    1436                      .dwattr $C$DW$151, DW_AT_name("INTSEL5N6")
    1437                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_INTSEL5N6")
    1438                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1439                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1440              
    1441              $C$DW$152       .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$258)
    1443                      .dwattr $C$DW$152, DW_AT_name("INTSEL7N8")
    1444                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_INTSEL7N8")
    1445                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1446                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1447              
    1448              $C$DW$153       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$260)
    1450                      .dwattr $C$DW$153, DW_AT_name("INTSEL9N10")
    1451                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_INTSEL9N10")
    1452                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1453                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1454              
    1455              $C$DW$154       .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$42)
    1457                      .dwattr $C$DW$154, DW_AT_name("rsvd2")
    1458                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd2")
    1459                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1460                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1461              
    1462              $C$DW$155       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$407)
    1464                      .dwattr $C$DW$155, DW_AT_name("SOCPRICTL")
    1465                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_SOCPRICTL")
    1466                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1467                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1468              
    1469              $C$DW$156       .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1471                      .dwattr $C$DW$156, DW_AT_name("rsvd3")
    1472                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd3")
    1473                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1474                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1475              
    1476              $C$DW$157       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$36)
    1478                      .dwattr $C$DW$157, DW_AT_name("ADCSAMPLEMODE")
    1479                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    1480                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1481                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1482              
    1483              $C$DW$158       .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1485                      .dwattr $C$DW$158, DW_AT_name("rsvd4")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   28

    1486                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd4")
    1487                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1488                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1489              
    1490              $C$DW$159       .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$25)
    1492                      .dwattr $C$DW$159, DW_AT_name("ADCINTSOCSEL1")
    1493                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    1494                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1495                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1496              
    1497              $C$DW$160       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    1499                      .dwattr $C$DW$160, DW_AT_name("ADCINTSOCSEL2")
    1500                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    1501                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1502                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1503              
    1504              $C$DW$161       .dwtag  DW_TAG_member
    1505                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$41)
    1506                      .dwattr $C$DW$161, DW_AT_name("rsvd5")
    1507                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rsvd5")
    1508                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1509                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1510              
    1511              $C$DW$162       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$38)
    1513                      .dwattr $C$DW$162, DW_AT_name("ADCSOCFLG1")
    1514                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    1515                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1516                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1517              
    1518              $C$DW$163       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1520                      .dwattr $C$DW$163, DW_AT_name("rsvd6")
    1521                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd6")
    1522                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1523                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1524              
    1525              $C$DW$164       .dwtag  DW_TAG_member
    1526                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$38)
    1527                      .dwattr $C$DW$164, DW_AT_name("ADCSOCFRC1")
    1528                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    1529                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1530                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1531              
    1532              $C$DW$165       .dwtag  DW_TAG_member
    1533                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1534                      .dwattr $C$DW$165, DW_AT_name("rsvd7")
    1535                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd7")
    1536                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1537                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1538              
    1539              $C$DW$166       .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$38)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   29

    1541                      .dwattr $C$DW$166, DW_AT_name("ADCSOCOVF1")
    1542                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    1543                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1544                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1545              
    1546              $C$DW$167       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1548                      .dwattr $C$DW$167, DW_AT_name("rsvd8")
    1549                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd8")
    1550                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1551                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1552              
    1553              $C$DW$168       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$38)
    1555                      .dwattr $C$DW$168, DW_AT_name("ADCSOCOVFCLR1")
    1556                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    1557                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1558                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1559              
    1560              $C$DW$169       .dwtag  DW_TAG_member
    1561                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1562                      .dwattr $C$DW$169, DW_AT_name("rsvd9")
    1563                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd9")
    1564                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1565                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1566              
    1567              $C$DW$170       .dwtag  DW_TAG_member
    1568                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$40)
    1569                      .dwattr $C$DW$170, DW_AT_name("ADCSOC0CTL")
    1570                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_ADCSOC0CTL")
    1571                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1572                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1573              
    1574              $C$DW$171       .dwtag  DW_TAG_member
    1575                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$40)
    1576                      .dwattr $C$DW$171, DW_AT_name("ADCSOC1CTL")
    1577                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_ADCSOC1CTL")
    1578                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1579                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1580              
    1581              $C$DW$172       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$40)
    1583                      .dwattr $C$DW$172, DW_AT_name("ADCSOC2CTL")
    1584                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_ADCSOC2CTL")
    1585                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1586                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1587              
    1588              $C$DW$173       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$40)
    1590                      .dwattr $C$DW$173, DW_AT_name("ADCSOC3CTL")
    1591                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_ADCSOC3CTL")
    1592                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1593                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1594              
    1595              $C$DW$174       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   30

    1596                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$40)
    1597                      .dwattr $C$DW$174, DW_AT_name("ADCSOC4CTL")
    1598                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_ADCSOC4CTL")
    1599                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1600                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1601              
    1602              $C$DW$175       .dwtag  DW_TAG_member
    1603                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$40)
    1604                      .dwattr $C$DW$175, DW_AT_name("ADCSOC5CTL")
    1605                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_ADCSOC5CTL")
    1606                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1607                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1608              
    1609              $C$DW$176       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$40)
    1611                      .dwattr $C$DW$176, DW_AT_name("ADCSOC6CTL")
    1612                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ADCSOC6CTL")
    1613                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1614                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1615              
    1616              $C$DW$177       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$40)
    1618                      .dwattr $C$DW$177, DW_AT_name("ADCSOC7CTL")
    1619                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_ADCSOC7CTL")
    1620                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1621                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1622              
    1623              $C$DW$178       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$40)
    1625                      .dwattr $C$DW$178, DW_AT_name("ADCSOC8CTL")
    1626                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_ADCSOC8CTL")
    1627                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1628                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1629              
    1630              $C$DW$179       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$40)
    1632                      .dwattr $C$DW$179, DW_AT_name("ADCSOC9CTL")
    1633                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ADCSOC9CTL")
    1634                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1635                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1636              
    1637              $C$DW$180       .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$40)
    1639                      .dwattr $C$DW$180, DW_AT_name("ADCSOC10CTL")
    1640                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_ADCSOC10CTL")
    1641                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1642                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1643              
    1644              $C$DW$181       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$40)
    1646                      .dwattr $C$DW$181, DW_AT_name("ADCSOC11CTL")
    1647                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_ADCSOC11CTL")
    1648                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1649                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1650              
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   31

    1651              $C$DW$182       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$40)
    1653                      .dwattr $C$DW$182, DW_AT_name("ADCSOC12CTL")
    1654                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_ADCSOC12CTL")
    1655                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1656                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1657              
    1658              $C$DW$183       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$40)
    1660                      .dwattr $C$DW$183, DW_AT_name("ADCSOC13CTL")
    1661                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_ADCSOC13CTL")
    1662                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1663                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1664              
    1665              $C$DW$184       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$40)
    1667                      .dwattr $C$DW$184, DW_AT_name("ADCSOC14CTL")
    1668                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_ADCSOC14CTL")
    1669                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1670                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1671              
    1672              $C$DW$185       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$40)
    1674                      .dwattr $C$DW$185, DW_AT_name("ADCSOC15CTL")
    1675                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_ADCSOC15CTL")
    1676                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    1677                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1678              
    1679              $C$DW$186       .dwtag  DW_TAG_member
    1680                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$43)
    1681                      .dwattr $C$DW$186, DW_AT_name("rsvd10")
    1682                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd10")
    1683                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1684                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1685              
    1686              $C$DW$187       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$34)
    1688                      .dwattr $C$DW$187, DW_AT_name("ADCREFTRIM")
    1689                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_ADCREFTRIM")
    1690                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1691                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1692              
    1693              $C$DW$188       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$32)
    1695                      .dwattr $C$DW$188, DW_AT_name("ADCOFFTRIM")
    1696                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    1697                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1698                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1699              
    1700              $C$DW$189       .dwtag  DW_TAG_member
    1701                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$44)
    1702                      .dwattr $C$DW$189, DW_AT_name("rsvd11")
    1703                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd11")
    1704                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1705                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_GlobalVariableDefs.asm                                      PAGE   32

    1706              
    1707              $C$DW$190       .dwtag  DW_TAG_member
