TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_CpuTimers.asm                                               PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                 Unix v15.12.1.LTS *
       3              ;* Date/Time created: Wed Jun 29 07:17:38 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DSP2803x_CpuTimers.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen Unix v15.12.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/kuotungtsai/controlSUITE/development_kits/HVMotorCtrl+PfcKit
      13                      .global _CpuTimer1
      14 00000000       _CpuTimer1:     .usect  ".ebss",8,1,1
      15              $C$DW$1 .dwtag  DW_TAG_variable
      16                      .dwattr $C$DW$1, DW_AT_name("CpuTimer1")

     258                      .dwattr $C$DW$17, DW_AT_name("FS$$TOL")
     259                      .dwattr $C$DW$17, DW_AT_TI_call
     260              
     261 0000004d 7640!         LCR       #FS$$TOL              ; [CPU_] |84| 
         0000004e 0000 
     262                      ; call occurs [#FS$$TOL] ; [] |84| 
     263 0000004f 1E48          MOVL      *-SP[8],ACC           ; [CPU_] |84| 
     264                      .dwpsn  file "../DSP2803x_CpuTimers.c",line 85,column 2,is_stmt,isa 0
     265 00000050 8A44          MOVL      XAR4,*-SP[4]          ; [CPU_] |85| 
     266 00000051 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |85| 
     267 00000052 1ED4          MOVL      *+XAR4[2],ACC         ; [CPU_] |85| 
     268                      .dwpsn  file "../DSP2803x_CpuTimers.c",line 88,column 2,is_stmt,isa 0
     269 00000053 8A44          MOVL      XAR4,*-SP[4]          ; [CPU_] |88| 
     270 00000054 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |88| 
     271 00000055 2BF4          MOV       *+XAR4[6],#0          ; [CPU_] |88| 
     272                      .dwpsn  file "../DSP2803x_CpuTimers.c",line 89,column 2,is_stmt,isa 0
     273 00000056 8A44          MOVL      XAR4,*-SP[4]          ; [CPU_] |89| 
     274 00000057 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |89| 
     275 00000058 2BFC          MOV       *+XAR4[7],#0          ; [CPU_] |89| 
     276                      .dwpsn  file "../DSP2803x_CpuTimers.c",line 92,column 2,is_stmt,isa 0
     277 00000059 8A44          MOVL      XAR4,*-SP[4]          ; [CPU_] |92| 
     278 0000005a 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |92| 
     279 0000005b 1AE4          OR        *+XAR4[4],#0x0010     ; [CPU_] |92| 
         0000005c 0010 
     280                      .dwpsn  file "../DSP2803x_CpuTimers.c",line 93,column 2,is_stmt,isa 0
     281 0000005d 8A44          MOVL      XAR4,*-SP[4]          ; [CPU_] |93| 
     282 0000005e 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |93| 
     283 0000005f 1AE4          OR        *+XAR4[4],#0x0020     ; [CPU_] |93| 
         00000060 0020 
     284                      .dwpsn  file "../DSP2803x_CpuTimers.c",line 94,column 2,is_stmt,isa 0
     285 00000061 8A44          MOVL      XAR4,*-SP[4]          ; [CPU_] |94| 
     286 00000062 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |94| 
     287 00000063 1AE4          OR        *+XAR4[4],#0x0400     ; [CPU_] |94| 
         00000064 0400 
     288                      .dwpsn  file "../DSP2803x_CpuTimers.c",line 95,column 2,is_stmt,isa 0
     289 00000065 8A44          MOVL      XAR4,*-SP[4]          ; [CPU_] |95| 
     290 00000066 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |95| 
     291 00000067 1AE4          OR        *+XAR4[4],#0x0800     ; [CPU_] |95| 
         00000068 0800 
     292                      .dwpsn  file "../DSP2803x_CpuTimers.c",line 96,column 2,is_stmt,isa 0
     293 00000069 8A44          MOVL      XAR4,*-SP[4]          ; [CPU_] |96| 
     294 0000006a 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |96| 
     295 0000006b 1AE4          OR        *+XAR4[4],#0x4000     ; [CPU_] |96| 
         0000006c 4000 
     296                      .dwpsn  file "../DSP2803x_CpuTimers.c",line 99,column 2,is_stmt,isa 0
     297 0000006d 8A44          MOVL      XAR4,*-SP[4]          ; [CPU_] |99| 
     298 0000006e 0200          MOVB      ACC,#0                ; [CPU_] |99| 
     299 0000006f 1ED4          MOVL      *+XAR4[2],ACC         ; [CPU_] |99| 
     300                      .dwpsn  file "../DSP2803x_CpuTimers.c",line 100,column 1,is_stmt,isa 0
     301 00000070 FE88          SUBB      SP,#8                 ; [CPU_U] 
     302                      .dwcfi  cfa_offset, -2
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_CpuTimers.asm                                               PAGE    7

     303              $C$DW$18        .dwtag  DW_TAG_TI_branch
     304                      .dwattr $C$DW$18, DW_AT_low_pc(0x00)
     305                      .dwattr $C$DW$18, DW_AT_TI_return
     306              
     307 00000071 0006          LRETR     ; [CPU_] 
     308                      ; return occurs ; [] 
     309                      .dwattr $C$DW$9, DW_AT_TI_end_file("../DSP2803x_CpuTimers.c")
     310                      .dwattr $C$DW$9, DW_AT_TI_end_line(0x64)
     311                      .dwattr $C$DW$9, DW_AT_TI_end_column(0x01)
     312                      .dwendentry
     313                      .dwendtag $C$DW$9
     314              
     315              ;**************************************************************
     316              ;* UNDEFINED EXTERNAL REFERENCES                              *
     317              ;**************************************************************
     318                      .global _CpuTimer1Regs
     319                      .global _CpuTimer2Regs
     320                      .global _CpuTimer0Regs
     321                      .global FS$$MPY
     322                      .global FS$$TOL
     323              
     324              ;***************************************************************
     325              ;* TYPE INFORMATION                                            *
     326              ;***************************************************************
     327              
     328              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     329                      .dwattr $C$DW$T$20, DW_AT_name("CPUTIMER_REGS")
     330                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
     331              $C$DW$19        .dwtag  DW_TAG_member
     332                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$29)
     333                      .dwattr $C$DW$19, DW_AT_name("TIM")
     334                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_TIM")
     335                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     336                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     337              
     338              $C$DW$20        .dwtag  DW_TAG_member
     339                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$25)
     340                      .dwattr $C$DW$20, DW_AT_name("PRD")
     341                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_PRD")
     342                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     343                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     344              
     345              $C$DW$21        .dwtag  DW_TAG_member
     346                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$28)
     347                      .dwattr $C$DW$21, DW_AT_name("TCR")
     348                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_TCR")
     349                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     350                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     351              
     352              $C$DW$22        .dwtag  DW_TAG_member
     353                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     354                      .dwattr $C$DW$22, DW_AT_name("rsvd1")
     355                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_rsvd1")
     356                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     357                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_CpuTimers.asm                                               PAGE    8

     358              
     359              $C$DW$23        .dwtag  DW_TAG_member
     360                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$34)
     361                      .dwattr $C$DW$23, DW_AT_name("TPR")
     362                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_TPR")
     363                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     364                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     365              
     366              $C$DW$24        .dwtag  DW_TAG_member
     367                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$32)
     368                      .dwattr $C$DW$24, DW_AT_name("TPRH")
     369                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_TPRH")
     370                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     371                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     372              
     373                      .dwendtag $C$DW$T$20
     374              
     375              $C$DW$25        .dwtag  DW_TAG_TI_far_type
     376                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$20)
     377              
     378              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
     379                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$25)
     380              
     381              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     382                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     383                      .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
     384              
     385              
     386              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     387                      .dwattr $C$DW$T$24, DW_AT_name("CPUTIMER_VARS")
     388                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
     389              $C$DW$26        .dwtag  DW_TAG_member
     390                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$22)
     391                      .dwattr $C$DW$26, DW_AT_name("RegsAddr")
     392                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_RegsAddr")
     393                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     394                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     395              
     396              $C$DW$27        .dwtag  DW_TAG_member
     397                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$23)
     398                      .dwattr $C$DW$27, DW_AT_name("InterruptCount")
     399                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_InterruptCount")
     400                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     401                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     402              
     403              $C$DW$28        .dwtag  DW_TAG_member
     404                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$16)
     405                      .dwattr $C$DW$28, DW_AT_name("CPUFreqInMHz")
     406                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_CPUFreqInMHz")
     407                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     408                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     409              
     410              $C$DW$29        .dwtag  DW_TAG_member
     411                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$16)
     412                      .dwattr $C$DW$29, DW_AT_name("PeriodInUSec")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_CpuTimers.asm                                               PAGE    9

     413                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_PeriodInUSec")
     414                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     415                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     416              
     417                      .dwendtag $C$DW$T$24
     418              
     419              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
     420                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$24)
     421                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
     422              
     423              
     424              $C$DW$T$25      .dwtag  DW_TAG_union_type
     425                      .dwattr $C$DW$T$25, DW_AT_name("PRD_GROUP")
     426                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     427              $C$DW$30        .dwtag  DW_TAG_member
     428                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$23)
     429                      .dwattr $C$DW$30, DW_AT_name("all")
     430                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_all")
     431                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     432                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     433              
     434              $C$DW$31        .dwtag  DW_TAG_member
     435                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$26)
     436                      .dwattr $C$DW$31, DW_AT_name("half")
     437                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_half")
     438                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     439                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     440              
     441                      .dwendtag $C$DW$T$25
     442              
     443              
     444              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     445                      .dwattr $C$DW$T$26, DW_AT_name("PRD_REG")
     446                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     447              $C$DW$32        .dwtag  DW_TAG_member
     448                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     449                      .dwattr $C$DW$32, DW_AT_name("LSW")
     450                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_LSW")
     451                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     452                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     453              
     454              $C$DW$33        .dwtag  DW_TAG_member
     455                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     456                      .dwattr $C$DW$33, DW_AT_name("MSW")
     457                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_MSW")
     458                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     459                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     460              
     461                      .dwendtag $C$DW$T$26
     462              
     463              
     464              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     465                      .dwattr $C$DW$T$27, DW_AT_name("TCR_BITS")
     466                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     467              $C$DW$34        .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_CpuTimers.asm                                               PAGE   10

     468                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     469                      .dwattr $C$DW$34, DW_AT_name("rsvd1")
     470                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd1")
     471                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0c)
     472                      .dwattr $C$DW$34, DW_AT_bit_size(0x04)
     473                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     474                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     475              
     476              $C$DW$35        .dwtag  DW_TAG_member
     477                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     478                      .dwattr $C$DW$35, DW_AT_name("TSS")
     479                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_TSS")
     480                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0b)
     481                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     482                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     483                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     484              
     485              $C$DW$36        .dwtag  DW_TAG_member
     486                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     487                      .dwattr $C$DW$36, DW_AT_name("TRB")
     488                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_TRB")
     489                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0a)
     490                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     491                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     492                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     493              
     494              $C$DW$37        .dwtag  DW_TAG_member
     495                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     496                      .dwattr $C$DW$37, DW_AT_name("rsvd2")
     497                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd2")
     498                      .dwattr $C$DW$37, DW_AT_bit_offset(0x06)
     499                      .dwattr $C$DW$37, DW_AT_bit_size(0x04)
     500                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     501                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     502              
     503              $C$DW$38        .dwtag  DW_TAG_member
     504                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     505                      .dwattr $C$DW$38, DW_AT_name("SOFT")
     506                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_SOFT")
     507                      .dwattr $C$DW$38, DW_AT_bit_offset(0x05)
     508                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     509                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     510                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     511              
     512              $C$DW$39        .dwtag  DW_TAG_member
     513                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     514                      .dwattr $C$DW$39, DW_AT_name("FREE")
     515                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_FREE")
     516                      .dwattr $C$DW$39, DW_AT_bit_offset(0x04)
     517                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     518                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     519                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     520              
     521              $C$DW$40        .dwtag  DW_TAG_member
     522                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_CpuTimers.asm                                               PAGE   11

     523                      .dwattr $C$DW$40, DW_AT_name("rsvd3")
     524                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd3")
     525                      .dwattr $C$DW$40, DW_AT_bit_offset(0x02)
     526                      .dwattr $C$DW$40, DW_AT_bit_size(0x02)
     527                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     528                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     529              
     530              $C$DW$41        .dwtag  DW_TAG_member
     531                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     532                      .dwattr $C$DW$41, DW_AT_name("TIE")
     533                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_TIE")
     534                      .dwattr $C$DW$41, DW_AT_bit_offset(0x01)
     535                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     536                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     537                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     538              
     539              $C$DW$42        .dwtag  DW_TAG_member
     540                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     541                      .dwattr $C$DW$42, DW_AT_name("TIF")
     542                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_TIF")
     543                      .dwattr $C$DW$42, DW_AT_bit_offset(0x00)
     544                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     545                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     546                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     547              
     548                      .dwendtag $C$DW$T$27
     549              
     550              
     551              $C$DW$T$28      .dwtag  DW_TAG_union_type
     552                      .dwattr $C$DW$T$28, DW_AT_name("TCR_REG")
     553                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     554              $C$DW$43        .dwtag  DW_TAG_member
     555                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     556                      .dwattr $C$DW$43, DW_AT_name("all")
     557                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_all")
     558                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     559                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     560              
     561              $C$DW$44        .dwtag  DW_TAG_member
     562                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$27)
     563                      .dwattr $C$DW$44, DW_AT_name("bit")
     564                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_bit")
     565                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     566                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     567              
     568                      .dwendtag $C$DW$T$28
     569              
     570              
     571              $C$DW$T$29      .dwtag  DW_TAG_union_type
     572                      .dwattr $C$DW$T$29, DW_AT_name("TIM_GROUP")
     573                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     574              $C$DW$45        .dwtag  DW_TAG_member
     575                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$23)
     576                      .dwattr $C$DW$45, DW_AT_name("all")
     577                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_CpuTimers.asm                                               PAGE   12

     578                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     579                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     580              
     581              $C$DW$46        .dwtag  DW_TAG_member
     582                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$30)
     583                      .dwattr $C$DW$46, DW_AT_name("half")
     584                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_half")
     585                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     586                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     587              
     588                      .dwendtag $C$DW$T$29
     589              
     590              
     591              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     592                      .dwattr $C$DW$T$30, DW_AT_name("TIM_REG")
     593                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     594              $C$DW$47        .dwtag  DW_TAG_member
     595                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     596                      .dwattr $C$DW$47, DW_AT_name("LSW")
     597                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_LSW")
     598                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     599                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     600              
     601              $C$DW$48        .dwtag  DW_TAG_member
     602                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     603                      .dwattr $C$DW$48, DW_AT_name("MSW")
     604                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_MSW")
     605                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     606                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     607              
     608                      .dwendtag $C$DW$T$30
     609              
     610              
     611              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     612                      .dwattr $C$DW$T$31, DW_AT_name("TPRH_BITS")
     613                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     614              $C$DW$49        .dwtag  DW_TAG_member
     615                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     616                      .dwattr $C$DW$49, DW_AT_name("TDDRH")
     617                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_TDDRH")
     618                      .dwattr $C$DW$49, DW_AT_bit_offset(0x08)
     619                      .dwattr $C$DW$49, DW_AT_bit_size(0x08)
     620                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     621                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     622              
     623              $C$DW$50        .dwtag  DW_TAG_member
     624                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     625                      .dwattr $C$DW$50, DW_AT_name("PSCH")
     626                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_PSCH")
     627                      .dwattr $C$DW$50, DW_AT_bit_offset(0x00)
     628                      .dwattr $C$DW$50, DW_AT_bit_size(0x08)
     629                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     631              
     632                      .dwendtag $C$DW$T$31
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_CpuTimers.asm                                               PAGE   13

     633              
     634              
     635              $C$DW$T$32      .dwtag  DW_TAG_union_type
     636                      .dwattr $C$DW$T$32, DW_AT_name("TPRH_REG")
     637                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     638              $C$DW$51        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     640                      .dwattr $C$DW$51, DW_AT_name("all")
     641                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_all")
     642                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     643                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     644              
     645              $C$DW$52        .dwtag  DW_TAG_member
     646                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$31)
     647                      .dwattr $C$DW$52, DW_AT_name("bit")
     648                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_bit")
     649                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     650                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     651              
     652                      .dwendtag $C$DW$T$32
     653              
     654              
     655              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     656                      .dwattr $C$DW$T$33, DW_AT_name("TPR_BITS")
     657                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     658              $C$DW$53        .dwtag  DW_TAG_member
     659                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     660                      .dwattr $C$DW$53, DW_AT_name("TDDR")
     661                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_TDDR")
     662                      .dwattr $C$DW$53, DW_AT_bit_offset(0x08)
     663                      .dwattr $C$DW$53, DW_AT_bit_size(0x08)
     664                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     665                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     666              
     667              $C$DW$54        .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     669                      .dwattr $C$DW$54, DW_AT_name("PSC")
     670                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PSC")
     671                      .dwattr $C$DW$54, DW_AT_bit_offset(0x00)
     672                      .dwattr $C$DW$54, DW_AT_bit_size(0x08)
     673                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     675              
     676                      .dwendtag $C$DW$T$33
     677              
     678              
     679              $C$DW$T$34      .dwtag  DW_TAG_union_type
     680                      .dwattr $C$DW$T$34, DW_AT_name("TPR_REG")
     681                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     682              $C$DW$55        .dwtag  DW_TAG_member
     683                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     684                      .dwattr $C$DW$55, DW_AT_name("all")
     685                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_all")
     686                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     687                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_CpuTimers.asm                                               PAGE   14

     688              
     689              $C$DW$56        .dwtag  DW_TAG_member
     690                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$33)
     691                      .dwattr $C$DW$56, DW_AT_name("bit")
     692                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_bit")
     693                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     694                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     695              
     696                      .dwendtag $C$DW$T$34
     697              
     698              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     699                      .dwattr $C$DW$T$2, DW_AT_name("void")
     700              
     701              $C$DW$T$4       .dwtag  DW_TAG_base_type
     702                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     703                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     704                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     705              
     706              $C$DW$T$5       .dwtag  DW_TAG_base_type
     707                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     708                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     709                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     710              
     711              $C$DW$T$6       .dwtag  DW_TAG_base_type
     712                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     713                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     714                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     715              
     716              $C$DW$T$7       .dwtag  DW_TAG_base_type
     717                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     718                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     719                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     720              
     721              $C$DW$T$8       .dwtag  DW_TAG_base_type
     722                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     723                      .dwattr $C$DW$T$8, DW_AT_name("short")
     724                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     725              
     726              $C$DW$T$9       .dwtag  DW_TAG_base_type
     727                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     728                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     729                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     730              
     731              $C$DW$T$10      .dwtag  DW_TAG_base_type
     732                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     733                      .dwattr $C$DW$T$10, DW_AT_name("int")
     734                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     735              
     736              $C$DW$T$11      .dwtag  DW_TAG_base_type
     737                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     738                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     739                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     740              
     741              $C$DW$T$19      .dwtag  DW_TAG_typedef
     742                      .dwattr $C$DW$T$19, DW_AT_name("Uint16")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:38 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DSP2803x_CpuTimers.asm                                               PAGE   15

     743                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
     744                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     745              
     746              $C$DW$T$12      .dwtag  DW_TAG_base_type
     747                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     748                      .dwattr $C$DW$T$12, DW_AT_name("long")
     749                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     750              
     751              $C$DW$T$13      .dwtag  DW_TAG_base_type
     752                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     753                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
