TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                 Unix v15.12.1.LTS *
       3              ;* Date/Time created: Wed Jun 29 07:17:39 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../HVBLDC_Sensorless.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen Unix v15.12.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/kuotungtsai/controlSUITE/development_kits/HVMotorCtrl+PfcKit
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    6528 00000500 0214          MOVB      ACC,#20               ; [CPU_] |1296| 
    6529 00000501 1E26-         MOVL      @_cmtn1+38,ACC        ; [CPU_] |1296| 
    6530                      .dwpsn  file "../HVBLDC_Sensorless.c",line 1297,column 6,is_stmt,isa 0
    6531 00000502 0202          MOVB      ACC,#2                ; [CPU_] |1297| 
    6532 00000503 1E24-         MOVL      @_cmtn1+36,ACC        ; [CPU_] |1297| 
    6533                      .dwpsn  file "../HVBLDC_Sensorless.c",line 1298,column 9,is_stmt,isa 0
    6534 00000504 0626-         MOVL      ACC,@_cmtn1+38        ; [CPU_] |1298| 
    6535 00000505 0324-         SUBL      ACC,@_cmtn1+36        ; [CPU_] |1298| 
    6536 00000506 1E20-         MOVL      @_cmtn1+32,ACC        ; [CPU_] |1298| 
    6537                      .dwpsn  file "../HVBLDC_Sensorless.c",line 1304,column 9,is_stmt,isa 0
    6538 00000507 0214          MOVB      ACC,#20               ; [CPU_] |1304| 
    6539 00000508 761F-         MOVW      DP,#_cmtninv1+38      ; [CPU_U] 
         00000509 0007 
    6540 0000050a 1E26-         MOVL      @_cmtninv1+38,ACC     ; [CPU_] |1304| 
    6541                      .dwpsn  file "../HVBLDC_Sensorless.c",line 1305,column 9,is_stmt,isa 0
    6542 0000050b 0202          MOVB      ACC,#2                ; [CPU_] |1305| 
    6543 0000050c 1E24-         MOVL      @_cmtninv1+36,ACC     ; [CPU_] |1305| 
    6544                      .dwpsn  file "../HVBLDC_Sensorless.c",line 1306,column 9,is_stmt,isa 0
    6545 0000050d 0626-         MOVL      ACC,@_cmtninv1+38     ; [CPU_] |1306| 
    6546 0000050e 0324-         SUBL      ACC,@_cmtninv1+36     ; [CPU_] |1306| 
    6547 0000050f 1E20-         MOVL      @_cmtninv1+32,ACC     ; [CPU_] |1306| 
    6548                      .dwpsn  file "../HVBLDC_Sensorless.c",line 1307,column 1,is_stmt,isa 0
    6549              $C$DW$161       .dwtag  DW_TAG_TI_branch
    6550                      .dwattr $C$DW$161, DW_AT_low_pc(0x00)
    6551                      .dwattr $C$DW$161, DW_AT_TI_return
    6552              
    6553 00000510 0006          LRETR     ; [CPU_] 
    6554                      ; return occurs ; [] 
    6555                      .dwattr $C$DW$160, DW_AT_TI_end_file("../HVBLDC_Sensorless.c")
    6556                      .dwattr $C$DW$160, DW_AT_TI_end_line(0x51b)
    6557                      .dwattr $C$DW$160, DW_AT_TI_end_column(0x01)
    6558                      .dwendentry
    6559                      .dwendtag $C$DW$160
    6560              
    6561              ;***************************************************************
    6562              ;* FLOATING-POINT CONSTANTS                                    *
    6563              ;***************************************************************
    6564 00000000               .sect   ".econst"
    6565                      .align  2
    6566 00000000 0000  $C$FL1: .xldouble       $strtod("0x1p+24")
         00000001 0000 
         00000002 0000 
         00000003 4170 
    6567              ;**************************************************************
    6568              ;* UNDEFINED EXTERNAL REFERENCES                              *
    6569              ;**************************************************************
    6570                      .global _DeviceInit
    6571                      .global _DSP28x_usDelay
    6572                      .global _DLOG_4CH_init
    6573                      .global _InitCpuTimers
    6574                      .global _ConfigCpuTimer
    6575                      .global _InitFlash
    6576                      .global _MemCopy
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  142

    6577                      .global _DLOG_4CH_update
    6578                      .global _RamfuncsLoadStart
    6579                      .global _RamfuncsRunStart
    6580                      .global _RamfuncsLoadEnd
    6581                      .global __IQ24div
    6582                      .global _CpuTimer2Regs
    6583                      .global _CpuTimer1
    6584                      .global _CpuTimer0
    6585                      .global _CpuTimer1Regs
    6586                      .global _CpuTimer2
    6587                      .global _CpuTimer0Regs
    6588                      .global _PieCtrlRegs
    6589                      .global _ECap1Regs
    6590                      .global _AdcResult
    6591                      .global _GpioDataRegs
    6592                      .global _EPwm4Regs
    6593                      .global _EPwm5Regs
    6594                      .global _EPwm2Regs
    6595                      .global _EPwm3Regs
    6596                      .global _EPwm6Regs
    6597                      .global _EPwm7Regs
    6598                      .global _EPwm1Regs
    6599                      .global _EQep1Regs
    6600                      .global _AdcRegs
    6601                      .global _PieVectTable
    6602                      .global FD$$MPY
    6603                      .global FS$$TOFD
    6604                      .global FS$$DIV
    6605                      .global FD$$TOL
    6606              
    6607              ;***************************************************************
    6608              ;* TYPE INFORMATION                                            *
    6609              ;***************************************************************
    6610              
    6611              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    6612                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
    6613              $C$DW$162       .dwtag  DW_TAG_member
    6614                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    6615                      .dwattr $C$DW$162, DW_AT_name("Ref")
    6616                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_Ref")
    6617                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6618                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    6619              
    6620              $C$DW$163       .dwtag  DW_TAG_member
    6621                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    6622                      .dwattr $C$DW$163, DW_AT_name("Fbk")
    6623                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_Fbk")
    6624                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6625                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    6626              
    6627              $C$DW$164       .dwtag  DW_TAG_member
    6628                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    6629                      .dwattr $C$DW$164, DW_AT_name("Out")
    6630                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_Out")
    6631                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  143

    6632                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    6633              
    6634              $C$DW$165       .dwtag  DW_TAG_member
    6635                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    6636                      .dwattr $C$DW$165, DW_AT_name("Kp")
    6637                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_Kp")
    6638                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6639                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    6640              
    6641              $C$DW$166       .dwtag  DW_TAG_member
    6642                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    6643                      .dwattr $C$DW$166, DW_AT_name("Ki")
    6644                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_Ki")
    6645                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6646                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    6647              
    6648              $C$DW$167       .dwtag  DW_TAG_member
    6649                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    6650                      .dwattr $C$DW$167, DW_AT_name("Umax")
    6651                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_Umax")
    6652                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6653                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    6654              
    6655              $C$DW$168       .dwtag  DW_TAG_member
    6656                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    6657                      .dwattr $C$DW$168, DW_AT_name("Umin")
    6658                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_Umin")
    6659                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6660                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    6661              
    6662              $C$DW$169       .dwtag  DW_TAG_member
    6663                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    6664                      .dwattr $C$DW$169, DW_AT_name("up")
    6665                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_up")
    6666                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6667                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    6668              
    6669              $C$DW$170       .dwtag  DW_TAG_member
    6670                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    6671                      .dwattr $C$DW$170, DW_AT_name("ui")
    6672                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_ui")
    6673                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6674                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    6675              
    6676              $C$DW$171       .dwtag  DW_TAG_member
    6677                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    6678                      .dwattr $C$DW$171, DW_AT_name("v1")
    6679                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_v1")
    6680                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6681                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    6682              
    6683              $C$DW$172       .dwtag  DW_TAG_member
    6684                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    6685                      .dwattr $C$DW$172, DW_AT_name("i1")
    6686                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_i1")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  144

    6687                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6688                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    6689              
    6690              $C$DW$173       .dwtag  DW_TAG_member
    6691                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    6692                      .dwattr $C$DW$173, DW_AT_name("w1")
    6693                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_w1")
    6694                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6695                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    6696              
    6697                      .dwendtag $C$DW$T$20
    6698              
    6699              $C$DW$T$204     .dwtag  DW_TAG_typedef
    6700                      .dwattr $C$DW$T$204, DW_AT_name("PI_CONTROLLER")
    6701                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$20)
    6702                      .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    6703              
    6704              
    6705              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6706                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x05)
    6707              $C$DW$174       .dwtag  DW_TAG_member
    6708                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$21)
    6709                      .dwattr $C$DW$174, DW_AT_name("CmtnPointer")
    6710                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_CmtnPointer")
    6711                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6712                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    6713              
    6714              $C$DW$175       .dwtag  DW_TAG_member
    6715                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    6716                      .dwattr $C$DW$175, DW_AT_name("MfuncPeriod")
    6717                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_MfuncPeriod")
    6718                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6719                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    6720              
    6721              $C$DW$176       .dwtag  DW_TAG_member
    6722                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$21)
    6723                      .dwattr $C$DW$176, DW_AT_name("PeriodMax")
    6724                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PeriodMax")
    6725                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6726                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    6727              
    6728              $C$DW$177       .dwtag  DW_TAG_member
    6729                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    6730                      .dwattr $C$DW$177, DW_AT_name("DutyFunc")
    6731                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_DutyFunc")
    6732                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6733                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    6734              
    6735              $C$DW$178       .dwtag  DW_TAG_member
    6736                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$21)
    6737                      .dwattr $C$DW$178, DW_AT_name("PwmActive")
    6738                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PwmActive")
    6739                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6740                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    6741              
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  145

    6742                      .dwendtag $C$DW$T$23
    6743              
    6744              $C$DW$T$205     .dwtag  DW_TAG_typedef
    6745                      .dwattr $C$DW$T$205, DW_AT_name("PWMGEN")
    6746                      .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$23)
    6747                      .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
    6748              
    6749              
    6750              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    6751                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    6752              $C$DW$179       .dwtag  DW_TAG_member
    6753                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    6754                      .dwattr $C$DW$179, DW_AT_name("TargetValue")
    6755                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_TargetValue")
    6756                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6757                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    6758              
    6759              $C$DW$180       .dwtag  DW_TAG_member
    6760                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$24)
    6761                      .dwattr $C$DW$180, DW_AT_name("RampDelayMax")
    6762                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_RampDelayMax")
    6763                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6764                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    6765              
    6766              $C$DW$181       .dwtag  DW_TAG_member
    6767                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    6768                      .dwattr $C$DW$181, DW_AT_name("RampLowLimit")
    6769                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_RampLowLimit")
    6770                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6771                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    6772              
    6773              $C$DW$182       .dwtag  DW_TAG_member
    6774                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    6775                      .dwattr $C$DW$182, DW_AT_name("RampHighLimit")
    6776                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_RampHighLimit")
    6777                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6778                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    6779              
    6780              $C$DW$183       .dwtag  DW_TAG_member
    6781                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$24)
    6782                      .dwattr $C$DW$183, DW_AT_name("RampDelayCount")
    6783                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_RampDelayCount")
    6784                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6785                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    6786              
    6787              $C$DW$184       .dwtag  DW_TAG_member
    6788                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    6789                      .dwattr $C$DW$184, DW_AT_name("SetpointValue")
    6790                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_SetpointValue")
    6791                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6792                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    6793              
    6794              $C$DW$185       .dwtag  DW_TAG_member
    6795                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$24)
    6796                      .dwattr $C$DW$185, DW_AT_name("EqualFlag")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  146

    6797                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_EqualFlag")
    6798                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6799                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    6800              
    6801              $C$DW$186       .dwtag  DW_TAG_member
    6802                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    6803                      .dwattr $C$DW$186, DW_AT_name("Tmp")
    6804                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_Tmp")
    6805                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6806                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    6807              
    6808                      .dwendtag $C$DW$T$25
    6809              
    6810              $C$DW$T$206     .dwtag  DW_TAG_typedef
    6811                      .dwattr $C$DW$T$206, DW_AT_name("RMPCNTL")
    6812                      .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$25)
    6813                      .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    6814              
    6815              
    6816              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    6817                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    6818              $C$DW$187       .dwtag  DW_TAG_member
    6819                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
    6820                      .dwattr $C$DW$187, DW_AT_name("DesiredInput")
    6821                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_DesiredInput")
    6822                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6823                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    6824              
    6825              $C$DW$188       .dwtag  DW_TAG_member
    6826                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
    6827                      .dwattr $C$DW$188, DW_AT_name("Ramp2Max")
    6828                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_Ramp2Max")
    6829                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6830                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    6831              
    6832              $C$DW$189       .dwtag  DW_TAG_member
    6833                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    6834                      .dwattr $C$DW$189, DW_AT_name("Ramp2Min")
    6835                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_Ramp2Min")
    6836                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6837                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    6838              
    6839              $C$DW$190       .dwtag  DW_TAG_member
    6840                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$24)
    6841                      .dwattr $C$DW$190, DW_AT_name("Ramp2DelayCount")
    6842                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_Ramp2DelayCount")
    6843                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6844                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    6845              
    6846              $C$DW$191       .dwtag  DW_TAG_member
    6847                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$24)
    6848                      .dwattr $C$DW$191, DW_AT_name("Ramp2Delay")
    6849                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_Ramp2Delay")
    6850                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6851                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  147

    6852              
    6853              $C$DW$192       .dwtag  DW_TAG_member
    6854                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$22)
    6855                      .dwattr $C$DW$192, DW_AT_name("Out")
    6856                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_Out")
    6857                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6858                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    6859              
    6860                      .dwendtag $C$DW$T$26
    6861              
    6862              $C$DW$T$207     .dwtag  DW_TAG_typedef
    6863                      .dwattr $C$DW$T$207, DW_AT_name("RMP2")
    6864                      .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$26)
    6865                      .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    6866              
    6867              
    6868              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    6869                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    6870              $C$DW$193       .dwtag  DW_TAG_member
    6871                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$24)
    6872                      .dwattr $C$DW$193, DW_AT_name("DesiredInput")
    6873                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_DesiredInput")
    6874                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6875                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    6876              
    6877              $C$DW$194       .dwtag  DW_TAG_member
    6878                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$24)
    6879                      .dwattr $C$DW$194, DW_AT_name("Ramp3Delay")
    6880                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_Ramp3Delay")
    6881                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6882                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    6883              
    6884              $C$DW$195       .dwtag  DW_TAG_member
    6885                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$24)
    6886                      .dwattr $C$DW$195, DW_AT_name("Ramp3DelayCount")
    6887                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_Ramp3DelayCount")
    6888                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6889                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    6890              
    6891              $C$DW$196       .dwtag  DW_TAG_member
    6892                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$27)
    6893                      .dwattr $C$DW$196, DW_AT_name("Out")
    6894                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_Out")
    6895                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6896                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    6897              
    6898              $C$DW$197       .dwtag  DW_TAG_member
    6899                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    6900                      .dwattr $C$DW$197, DW_AT_name("Ramp3Min")
    6901                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_Ramp3Min")
    6902                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6903                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    6904              
    6905              $C$DW$198       .dwtag  DW_TAG_member
    6906                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  148

    6907                      .dwattr $C$DW$198, DW_AT_name("Ramp3DoneFlag")
    6908                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_Ramp3DoneFlag")
    6909                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6910                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    6911              
    6912                      .dwendtag $C$DW$T$28
    6913              
    6914              $C$DW$T$208     .dwtag  DW_TAG_typedef
    6915                      .dwattr $C$DW$T$208, DW_AT_name("RMP3")
    6916                      .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$28)
    6917                      .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
    6918              
    6919              
    6920              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    6921                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    6922              $C$DW$199       .dwtag  DW_TAG_member
    6923                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$24)
    6924                      .dwattr $C$DW$199, DW_AT_name("TrigInput")
    6925                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_TrigInput")
    6926                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6927                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    6928              
    6929              $C$DW$200       .dwtag  DW_TAG_member
    6930                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$24)
    6931                      .dwattr $C$DW$200, DW_AT_name("Counter")
    6932                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_Counter")
    6933                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6934                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    6935              
    6936                      .dwendtag $C$DW$T$29
    6937              
    6938              $C$DW$T$209     .dwtag  DW_TAG_typedef
    6939                      .dwattr $C$DW$T$209, DW_AT_name("MOD6CNT")
    6940                      .dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$29)
    6941                      .dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
    6942              
    6943              
    6944              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6945                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x06)
    6946              $C$DW$201       .dwtag  DW_TAG_member
    6947                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$24)
    6948                      .dwattr $C$DW$201, DW_AT_name("TrigInput")
    6949                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_TrigInput")
    6950                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6951                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    6952              
    6953              $C$DW$202       .dwtag  DW_TAG_member
    6954                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$24)
    6955                      .dwattr $C$DW$202, DW_AT_name("Counter")
    6956                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_Counter")
    6957                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6958                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    6959              
    6960              $C$DW$203       .dwtag  DW_TAG_member
    6961                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  149

    6962                      .dwattr $C$DW$203, DW_AT_name("Direction")
    6963                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_Direction")
    6964                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6965                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    6966              
    6967                      .dwendtag $C$DW$T$30
    6968              
    6969              $C$DW$T$210     .dwtag  DW_TAG_typedef
    6970                      .dwattr $C$DW$T$210, DW_AT_name("MOD6CNTINV")
    6971                      .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$30)
    6972                      .dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
    6973              
    6974              
    6975              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6976                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x06)
    6977              $C$DW$204       .dwtag  DW_TAG_member
    6978                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$24)
    6979                      .dwattr $C$DW$204, DW_AT_name("Period")
    6980                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_Period")
    6981                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6982                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    6983              
    6984              $C$DW$205       .dwtag  DW_TAG_member
    6985                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$24)
    6986                      .dwattr $C$DW$205, DW_AT_name("Out")
    6987                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_Out")
    6988                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6989                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    6990              
    6991              $C$DW$206       .dwtag  DW_TAG_member
    6992                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$24)
    6993                      .dwattr $C$DW$206, DW_AT_name("Counter")
    6994                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_Counter")
    6995                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6996                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    6997              
    6998                      .dwendtag $C$DW$T$31
    6999              
    7000              $C$DW$T$211     .dwtag  DW_TAG_typedef
    7001                      .dwattr $C$DW$T$211, DW_AT_name("IMPULSE")
    7002                      .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$31)
    7003                      .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    7004              
    7005              
    7006              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    7007                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x2c)
    7008              $C$DW$207       .dwtag  DW_TAG_member
    7009                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$24)
    7010                      .dwattr $C$DW$207, DW_AT_name("CmtnTrig")
    7011                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_CmtnTrig")
    7012                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7013                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    7014              
    7015              $C$DW$208       .dwtag  DW_TAG_member
    7016                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  150

    7017                      .dwattr $C$DW$208, DW_AT_name("Va")
    7018                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_Va")
    7019                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7020                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    7021              
    7022              $C$DW$209       .dwtag  DW_TAG_member
    7023                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    7024                      .dwattr $C$DW$209, DW_AT_name("Vb")
    7025                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_Vb")
    7026                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7027                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    7028              
    7029              $C$DW$210       .dwtag  DW_TAG_member
    7030                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    7031                      .dwattr $C$DW$210, DW_AT_name("Vc")
    7032                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_Vc")
    7033                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7034                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    7035              
    7036              $C$DW$211       .dwtag  DW_TAG_member
    7037                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    7038                      .dwattr $C$DW$211, DW_AT_name("Neutral")
    7039                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_Neutral")
    7040                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7041                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    7042              
    7043              $C$DW$212       .dwtag  DW_TAG_member
    7044                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$24)
    7045                      .dwattr $C$DW$212, DW_AT_name("RevPeriod")
    7046                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_RevPeriod")
    7047                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7048                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    7049              
    7050              $C$DW$213       .dwtag  DW_TAG_member
    7051                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$24)
    7052                      .dwattr $C$DW$213, DW_AT_name("ZcTrig")
    7053                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_ZcTrig")
    7054                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7055                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    7056              
    7057              $C$DW$214       .dwtag  DW_TAG_member
    7058                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$24)
    7059                      .dwattr $C$DW$214, DW_AT_name("CmtnPointer")
    7060                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_CmtnPointer")
    7061                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7062                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    7063              
    7064              $C$DW$215       .dwtag  DW_TAG_member
    7065                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    7066                      .dwattr $C$DW$215, DW_AT_name("DebugBemf")
    7067                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_DebugBemf")
    7068                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7069                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    7070              
    7071              $C$DW$216       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  151

    7072                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$24)
    7073                      .dwattr $C$DW$216, DW_AT_name("NoiseWindowCounter")
    7074                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_NoiseWindowCounter")
    7075                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7076                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    7077              
    7078              $C$DW$217       .dwtag  DW_TAG_member
    7079                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$24)
    7080                      .dwattr $C$DW$217, DW_AT_name("Delay30DoneFlag")
    7081                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_Delay30DoneFlag")
    7082                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7083                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    7084              
    7085              $C$DW$218       .dwtag  DW_TAG_member
    7086                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$24)
    7087                      .dwattr $C$DW$218, DW_AT_name("NewTimeStamp")
    7088                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_NewTimeStamp")
    7089                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7090                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    7091              
    7092              $C$DW$219       .dwtag  DW_TAG_member
    7093                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$24)
    7094                      .dwattr $C$DW$219, DW_AT_name("OldTimeStamp")
    7095                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_OldTimeStamp")
    7096                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7097                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    7098              
    7099              $C$DW$220       .dwtag  DW_TAG_member
    7100                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$24)
    7101                      .dwattr $C$DW$220, DW_AT_name("VirtualTimer")
    7102                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_VirtualTimer")
    7103                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7104                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    7105              
    7106              $C$DW$221       .dwtag  DW_TAG_member
    7107                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$24)
    7108                      .dwattr $C$DW$221, DW_AT_name("CmtnDelay")
    7109                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_CmtnDelay")
    7110                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7111                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    7112              
    7113              $C$DW$222       .dwtag  DW_TAG_member
    7114                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$24)
    7115                      .dwattr $C$DW$222, DW_AT_name("DelayTaskPointer")
    7116                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_DelayTaskPointer")
    7117                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7118                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    7119              
    7120              $C$DW$223       .dwtag  DW_TAG_member
    7121                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$24)
    7122                      .dwattr $C$DW$223, DW_AT_name("NoiseWindowMax")
    7123                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_NoiseWindowMax")
    7124                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7125                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    7126              
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  152

    7127              $C$DW$224       .dwtag  DW_TAG_member
    7128                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$24)
    7129                      .dwattr $C$DW$224, DW_AT_name("CmtnDelayCounter")
    7130                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_CmtnDelayCounter")
    7131                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7132                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    7133              
    7134              $C$DW$225       .dwtag  DW_TAG_member
    7135                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$24)
    7136                      .dwattr $C$DW$225, DW_AT_name("NWDelta")
    7137                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_NWDelta")
    7138                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7139                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    7140              
    7141              $C$DW$226       .dwtag  DW_TAG_member
    7142                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$24)
    7143                      .dwattr $C$DW$226, DW_AT_name("NWDelayThres")
    7144                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_NWDelayThres")
    7145                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7146                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    7147              
    7148              $C$DW$227       .dwtag  DW_TAG_member
    7149                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$27)
    7150                      .dwattr $C$DW$227, DW_AT_name("GPR1_COM_TRIG")
    7151                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_GPR1_COM_TRIG")
    7152                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7153                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    7154              
    7155              $C$DW$228       .dwtag  DW_TAG_member
    7156                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
    7157                      .dwattr $C$DW$228, DW_AT_name("Tmp")
    7158                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_Tmp")
    7159                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7160                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    7161              
    7162                      .dwendtag $C$DW$T$32
    7163              
    7164              $C$DW$T$212     .dwtag  DW_TAG_typedef
    7165                      .dwattr $C$DW$T$212, DW_AT_name("CMTN")
    7166                      .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$32)
    7167                      .dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
    7168              
    7169              
    7170              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7171                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x2c)
    7172              $C$DW$229       .dwtag  DW_TAG_member
    7173                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$24)
    7174                      .dwattr $C$DW$229, DW_AT_name("CmtnTrig")
    7175                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_CmtnTrig")
    7176                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7177                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    7178              
    7179              $C$DW$230       .dwtag  DW_TAG_member
    7180                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    7181                      .dwattr $C$DW$230, DW_AT_name("Va")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  153

    7182                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_Va")
    7183                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7184                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    7185              
    7186              $C$DW$231       .dwtag  DW_TAG_member
    7187                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    7188                      .dwattr $C$DW$231, DW_AT_name("Vb")
    7189                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_Vb")
    7190                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7191                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    7192              
    7193              $C$DW$232       .dwtag  DW_TAG_member
    7194                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    7195                      .dwattr $C$DW$232, DW_AT_name("Vc")
    7196                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_Vc")
    7197                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7198                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    7199              
    7200              $C$DW$233       .dwtag  DW_TAG_member
    7201                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    7202                      .dwattr $C$DW$233, DW_AT_name("Neutral")
    7203                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_Neutral")
    7204                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7205                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    7206              
    7207              $C$DW$234       .dwtag  DW_TAG_member
    7208                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$24)
    7209                      .dwattr $C$DW$234, DW_AT_name("RevPeriod")
    7210                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_RevPeriod")
    7211                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7212                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    7213              
    7214              $C$DW$235       .dwtag  DW_TAG_member
    7215                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$24)
    7216                      .dwattr $C$DW$235, DW_AT_name("ZcTrig")
    7217                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_ZcTrig")
    7218                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7219                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    7220              
    7221              $C$DW$236       .dwtag  DW_TAG_member
    7222                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$24)
    7223                      .dwattr $C$DW$236, DW_AT_name("CmtnPointer")
    7224                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_CmtnPointer")
    7225                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7226                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    7227              
    7228              $C$DW$237       .dwtag  DW_TAG_member
    7229                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    7230                      .dwattr $C$DW$237, DW_AT_name("DebugBemf")
    7231                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_DebugBemf")
    7232                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7233                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    7234              
    7235              $C$DW$238       .dwtag  DW_TAG_member
    7236                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  154

    7237                      .dwattr $C$DW$238, DW_AT_name("NoiseWindowCounter")
    7238                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_NoiseWindowCounter")
    7239                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7240                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    7241              
    7242              $C$DW$239       .dwtag  DW_TAG_member
    7243                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$24)
    7244                      .dwattr $C$DW$239, DW_AT_name("Delay30DoneFlag")
    7245                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_Delay30DoneFlag")
    7246                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7247                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    7248              
    7249              $C$DW$240       .dwtag  DW_TAG_member
    7250                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$24)
    7251                      .dwattr $C$DW$240, DW_AT_name("NewTimeStamp")
    7252                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_NewTimeStamp")
    7253                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7254                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    7255              
    7256              $C$DW$241       .dwtag  DW_TAG_member
    7257                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$24)
    7258                      .dwattr $C$DW$241, DW_AT_name("OldTimeStamp")
    7259                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_OldTimeStamp")
    7260                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7261                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    7262              
    7263              $C$DW$242       .dwtag  DW_TAG_member
    7264                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$24)
    7265                      .dwattr $C$DW$242, DW_AT_name("VirtualTimer")
    7266                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_VirtualTimer")
    7267                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7268                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    7269              
    7270              $C$DW$243       .dwtag  DW_TAG_member
    7271                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$24)
    7272                      .dwattr $C$DW$243, DW_AT_name("CmtnDelay")
    7273                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_CmtnDelay")
    7274                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7275                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    7276              
    7277              $C$DW$244       .dwtag  DW_TAG_member
    7278                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$24)
    7279                      .dwattr $C$DW$244, DW_AT_name("DelayTaskPointer")
    7280                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_DelayTaskPointer")
    7281                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7282                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    7283              
    7284              $C$DW$245       .dwtag  DW_TAG_member
    7285                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$24)
    7286                      .dwattr $C$DW$245, DW_AT_name("NoiseWindowMax")
    7287                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_NoiseWindowMax")
    7288                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7289                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    7290              
    7291              $C$DW$246       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  155

    7292                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$24)
    7293                      .dwattr $C$DW$246, DW_AT_name("CmtnDelayCounter")
    7294                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_CmtnDelayCounter")
    7295                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7296                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    7297              
    7298              $C$DW$247       .dwtag  DW_TAG_member
    7299                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$24)
    7300                      .dwattr $C$DW$247, DW_AT_name("NWDelta")
    7301                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_NWDelta")
    7302                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7303                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    7304              
    7305              $C$DW$248       .dwtag  DW_TAG_member
    7306                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$24)
    7307                      .dwattr $C$DW$248, DW_AT_name("NWDelayThres")
    7308                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_NWDelayThres")
    7309                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7310                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    7311              
    7312              $C$DW$249       .dwtag  DW_TAG_member
    7313                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$27)
    7314                      .dwattr $C$DW$249, DW_AT_name("GPR1_COM_TRIG")
    7315                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_GPR1_COM_TRIG")
    7316                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7317                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    7318              
    7319              $C$DW$250       .dwtag  DW_TAG_member
    7320                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$27)
    7321                      .dwattr $C$DW$250, DW_AT_name("Tmp")
    7322                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_Tmp")
    7323                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7324                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    7325              
    7326                      .dwendtag $C$DW$T$33
    7327              
    7328              $C$DW$T$213     .dwtag  DW_TAG_typedef
    7329                      .dwattr $C$DW$T$213, DW_AT_name("CMTN_INV")
    7330                      .dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$33)
    7331                      .dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
    7332              
    7333              
    7334              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    7335                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x12)
    7336              $C$DW$251       .dwtag  DW_TAG_member
    7337                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$24)
    7338                      .dwattr $C$DW$251, DW_AT_name("NewTimeStamp")
    7339                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_NewTimeStamp")
    7340                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7341                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    7342              
    7343              $C$DW$252       .dwtag  DW_TAG_member
    7344                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$24)
    7345                      .dwattr $C$DW$252, DW_AT_name("OldTimeStamp")
    7346                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_OldTimeStamp")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  156

    7347                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7348                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    7349              
    7350              $C$DW$253       .dwtag  DW_TAG_member
    7351                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$24)
    7352                      .dwattr $C$DW$253, DW_AT_name("TimeStamp")
    7353                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_TimeStamp")
    7354                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7355                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    7356              
    7357              $C$DW$254       .dwtag  DW_TAG_member
    7358                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$24)
    7359                      .dwattr $C$DW$254, DW_AT_name("SpeedScaler")
    7360                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_SpeedScaler")
    7361                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7362                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    7363              
    7364              $C$DW$255       .dwtag  DW_TAG_member
    7365                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    7366                      .dwattr $C$DW$255, DW_AT_name("EventPeriod")
    7367                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_EventPeriod")
    7368                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7369                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    7370              
    7371              $C$DW$256       .dwtag  DW_TAG_member
    7372                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$22)
    7373                      .dwattr $C$DW$256, DW_AT_name("InputSelect")
    7374                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_InputSelect")
    7375                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7376                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    7377              
    7378              $C$DW$257       .dwtag  DW_TAG_member
    7379                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    7380                      .dwattr $C$DW$257, DW_AT_name("Speed")
    7381                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_Speed")
    7382                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7383                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    7384              
    7385              $C$DW$258       .dwtag  DW_TAG_member
    7386                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$24)
    7387                      .dwattr $C$DW$258, DW_AT_name("BaseRpm")
    7388                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_BaseRpm")
    7389                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7390                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    7391              
    7392              $C$DW$259       .dwtag  DW_TAG_member
    7393                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    7394                      .dwattr $C$DW$259, DW_AT_name("SpeedRpm")
    7395                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_SpeedRpm")
    7396                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7397                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    7398              
    7399                      .dwendtag $C$DW$T$34
    7400              
    7401              $C$DW$T$214     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  157

    7402                      .dwattr $C$DW$T$214, DW_AT_name("SPEED_MEAS_CAP")
    7403                      .dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$34)
    7404                      .dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
    7405              
    7406              
    7407              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    7408                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x16)
    7409              $C$DW$260       .dwtag  DW_TAG_member
    7410                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$12)
    7411                      .dwattr $C$DW$260, DW_AT_name("task")
    7412                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_task")
    7413                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7414                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    7415              
    7416              $C$DW$261       .dwtag  DW_TAG_member
    7417                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$35)
    7418                      .dwattr $C$DW$261, DW_AT_name("iptr1")
    7419                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_iptr1")
    7420                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7421                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    7422              
    7423              $C$DW$262       .dwtag  DW_TAG_member
    7424                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$35)
    7425                      .dwattr $C$DW$262, DW_AT_name("iptr2")
    7426                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_iptr2")
    7427                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7428                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    7429              
    7430              $C$DW$263       .dwtag  DW_TAG_member
    7431                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$35)
    7432                      .dwattr $C$DW$263, DW_AT_name("iptr3")
    7433                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_iptr3")
    7434                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7435                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    7436              
    7437              $C$DW$264       .dwtag  DW_TAG_member
    7438                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$35)
    7439                      .dwattr $C$DW$264, DW_AT_name("iptr4")
    7440                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_iptr4")
    7441                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7442                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    7443              
    7444              $C$DW$265       .dwtag  DW_TAG_member
    7445                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$10)
    7446                      .dwattr $C$DW$265, DW_AT_name("trig_value")
    7447                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_trig_value")
    7448                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7449                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    7450              
    7451              $C$DW$266       .dwtag  DW_TAG_member
    7452                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$10)
    7453                      .dwattr $C$DW$266, DW_AT_name("prescalar")
    7454                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_prescalar")
    7455                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7456                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  158

    7457              
    7458              $C$DW$267       .dwtag  DW_TAG_member
    7459                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$10)
    7460                      .dwattr $C$DW$267, DW_AT_name("skip_cntr")
    7461                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_skip_cntr")
    7462                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7463                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    7464              
    7465              $C$DW$268       .dwtag  DW_TAG_member
    7466                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$10)
    7467                      .dwattr $C$DW$268, DW_AT_name("cntr")
    7468                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_cntr")
    7469                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7470                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    7471              
    7472              $C$DW$269       .dwtag  DW_TAG_member
    7473                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$12)
    7474                      .dwattr $C$DW$269, DW_AT_name("write_ptr")
    7475                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_write_ptr")
    7476                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7477                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    7478              
    7479              $C$DW$270       .dwtag  DW_TAG_member
    7480                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$10)
    7481                      .dwattr $C$DW$270, DW_AT_name("size")
    7482                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_size")
    7483                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7484                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    7485              
    7486              $C$DW$271       .dwtag  DW_TAG_member
    7487                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$37)
    7488                      .dwattr $C$DW$271, DW_AT_name("init")
    7489                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_init")
    7490                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7491                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    7492              
    7493              $C$DW$272       .dwtag  DW_TAG_member
    7494                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$37)
    7495                      .dwattr $C$DW$272, DW_AT_name("update")
    7496                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_update")
    7497                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7498                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    7499              
    7500                      .dwendtag $C$DW$T$38
    7501              
    7502              $C$DW$T$215     .dwtag  DW_TAG_typedef
    7503                      .dwattr $C$DW$T$215, DW_AT_name("DLOG_4CH")
    7504                      .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$38)
    7505                      .dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
    7506              
    7507              
    7508              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7509                      .dwattr $C$DW$T$39, DW_AT_name("ADCCTL1_BITS")
    7510                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    7511              $C$DW$273       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  159

    7512                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$21)
    7513                      .dwattr $C$DW$273, DW_AT_name("TEMPCONV")
    7514                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_TEMPCONV")
    7515                      .dwattr $C$DW$273, DW_AT_bit_offset(0x0f)
    7516                      .dwattr $C$DW$273, DW_AT_bit_size(0x01)
    7517                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7518                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    7519              
    7520              $C$DW$274       .dwtag  DW_TAG_member
    7521                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$21)
    7522                      .dwattr $C$DW$274, DW_AT_name("VREFLOCONV")
    7523                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_VREFLOCONV")
    7524                      .dwattr $C$DW$274, DW_AT_bit_offset(0x0e)
    7525                      .dwattr $C$DW$274, DW_AT_bit_size(0x01)
    7526                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7527                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    7528              
    7529              $C$DW$275       .dwtag  DW_TAG_member
    7530                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$21)
    7531                      .dwattr $C$DW$275, DW_AT_name("INTPULSEPOS")
    7532                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_INTPULSEPOS")
    7533                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0d)
    7534                      .dwattr $C$DW$275, DW_AT_bit_size(0x01)
    7535                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7536                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    7537              
    7538              $C$DW$276       .dwtag  DW_TAG_member
    7539                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$21)
    7540                      .dwattr $C$DW$276, DW_AT_name("ADCREFSEL")
    7541                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_ADCREFSEL")
    7542                      .dwattr $C$DW$276, DW_AT_bit_offset(0x0c)
    7543                      .dwattr $C$DW$276, DW_AT_bit_size(0x01)
    7544                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7545                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    7546              
    7547              $C$DW$277       .dwtag  DW_TAG_member
    7548                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$21)
    7549                      .dwattr $C$DW$277, DW_AT_name("rsvd1")
    7550                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_rsvd1")
    7551                      .dwattr $C$DW$277, DW_AT_bit_offset(0x0b)
    7552                      .dwattr $C$DW$277, DW_AT_bit_size(0x01)
    7553                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7554                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    7555              
    7556              $C$DW$278       .dwtag  DW_TAG_member
    7557                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$21)
    7558                      .dwattr $C$DW$278, DW_AT_name("ADCREFPWD")
    7559                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_ADCREFPWD")
    7560                      .dwattr $C$DW$278, DW_AT_bit_offset(0x0a)
    7561                      .dwattr $C$DW$278, DW_AT_bit_size(0x01)
    7562                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7563                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    7564              
    7565              $C$DW$279       .dwtag  DW_TAG_member
    7566                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  160

    7567                      .dwattr $C$DW$279, DW_AT_name("ADCBGPWD")
    7568                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_ADCBGPWD")
    7569                      .dwattr $C$DW$279, DW_AT_bit_offset(0x09)
    7570                      .dwattr $C$DW$279, DW_AT_bit_size(0x01)
    7571                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7572                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    7573              
    7574              $C$DW$280       .dwtag  DW_TAG_member
    7575                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$21)
    7576                      .dwattr $C$DW$280, DW_AT_name("ADCPWDN")
    7577                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_ADCPWDN")
    7578                      .dwattr $C$DW$280, DW_AT_bit_offset(0x08)
    7579                      .dwattr $C$DW$280, DW_AT_bit_size(0x01)
    7580                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7581                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    7582              
    7583              $C$DW$281       .dwtag  DW_TAG_member
    7584                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$21)
    7585                      .dwattr $C$DW$281, DW_AT_name("ADCBSYCHN")
    7586                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_ADCBSYCHN")
    7587                      .dwattr $C$DW$281, DW_AT_bit_offset(0x03)
    7588                      .dwattr $C$DW$281, DW_AT_bit_size(0x05)
    7589                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7590                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    7591              
    7592              $C$DW$282       .dwtag  DW_TAG_member
    7593                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    7594                      .dwattr $C$DW$282, DW_AT_name("ADCBSY")
    7595                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_ADCBSY")
    7596                      .dwattr $C$DW$282, DW_AT_bit_offset(0x02)
    7597                      .dwattr $C$DW$282, DW_AT_bit_size(0x01)
    7598                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7599                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    7600              
    7601              $C$DW$283       .dwtag  DW_TAG_member
    7602                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$21)
    7603                      .dwattr $C$DW$283, DW_AT_name("ADCENABLE")
    7604                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_ADCENABLE")
    7605                      .dwattr $C$DW$283, DW_AT_bit_offset(0x01)
    7606                      .dwattr $C$DW$283, DW_AT_bit_size(0x01)
    7607                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7608                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    7609              
    7610              $C$DW$284       .dwtag  DW_TAG_member
    7611                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$21)
    7612                      .dwattr $C$DW$284, DW_AT_name("RESET")
    7613                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_RESET")
    7614                      .dwattr $C$DW$284, DW_AT_bit_offset(0x00)
    7615                      .dwattr $C$DW$284, DW_AT_bit_size(0x01)
    7616                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7617                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    7618              
    7619                      .dwendtag $C$DW$T$39
    7620              
    7621              
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  161

    7622              $C$DW$T$40      .dwtag  DW_TAG_union_type
    7623                      .dwattr $C$DW$T$40, DW_AT_name("ADCCTL1_REG")
    7624                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    7625              $C$DW$285       .dwtag  DW_TAG_member
    7626                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$21)
    7627                      .dwattr $C$DW$285, DW_AT_name("all")
    7628                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_all")
    7629                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7630                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    7631              
    7632              $C$DW$286       .dwtag  DW_TAG_member
    7633                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$39)
    7634                      .dwattr $C$DW$286, DW_AT_name("bit")
    7635                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_bit")
    7636                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7637                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    7638              
    7639                      .dwendtag $C$DW$T$40
    7640              
    7641              
    7642              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    7643                      .dwattr $C$DW$T$41, DW_AT_name("ADCCTL2_BITS")
    7644                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    7645              $C$DW$287       .dwtag  DW_TAG_member
    7646                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$21)
    7647                      .dwattr $C$DW$287, DW_AT_name("CLKDIV2EN")
    7648                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_CLKDIV2EN")
    7649                      .dwattr $C$DW$287, DW_AT_bit_offset(0x0f)
    7650                      .dwattr $C$DW$287, DW_AT_bit_size(0x01)
    7651                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7652                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    7653              
    7654              $C$DW$288       .dwtag  DW_TAG_member
    7655                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$21)
    7656                      .dwattr $C$DW$288, DW_AT_name("ADCNONOVERLAP")
    7657                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_ADCNONOVERLAP")
    7658                      .dwattr $C$DW$288, DW_AT_bit_offset(0x0e)
    7659                      .dwattr $C$DW$288, DW_AT_bit_size(0x01)
    7660                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7661                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    7662              
    7663              $C$DW$289       .dwtag  DW_TAG_member
    7664                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$21)
    7665                      .dwattr $C$DW$289, DW_AT_name("rsvd1")
    7666                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_rsvd1")
    7667                      .dwattr $C$DW$289, DW_AT_bit_offset(0x00)
    7668                      .dwattr $C$DW$289, DW_AT_bit_size(0x0e)
    7669                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7670                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    7671              
    7672                      .dwendtag $C$DW$T$41
    7673              
    7674              
    7675              $C$DW$T$42      .dwtag  DW_TAG_union_type
    7676                      .dwattr $C$DW$T$42, DW_AT_name("ADCCTL2_REG")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  162

    7677                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    7678              $C$DW$290       .dwtag  DW_TAG_member
    7679                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$21)
    7680                      .dwattr $C$DW$290, DW_AT_name("all")
    7681                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_all")
    7682                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7683                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    7684              
    7685              $C$DW$291       .dwtag  DW_TAG_member
    7686                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$41)
    7687                      .dwattr $C$DW$291, DW_AT_name("bit")
    7688                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_bit")
    7689                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7690                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    7691              
    7692                      .dwendtag $C$DW$T$42
    7693              
    7694              
    7695              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7696                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTSOCSEL1_BITS")
    7697                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    7698              $C$DW$292       .dwtag  DW_TAG_member
    7699                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$21)
    7700                      .dwattr $C$DW$292, DW_AT_name("SOC0")
    7701                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_SOC0")
    7702                      .dwattr $C$DW$292, DW_AT_bit_offset(0x0e)
    7703                      .dwattr $C$DW$292, DW_AT_bit_size(0x02)
    7704                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7705                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    7706              
    7707              $C$DW$293       .dwtag  DW_TAG_member
    7708                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$21)
    7709                      .dwattr $C$DW$293, DW_AT_name("SOC1")
    7710                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_SOC1")
    7711                      .dwattr $C$DW$293, DW_AT_bit_offset(0x0c)
    7712                      .dwattr $C$DW$293, DW_AT_bit_size(0x02)
    7713                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7714                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    7715              
    7716              $C$DW$294       .dwtag  DW_TAG_member
    7717                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$21)
    7718                      .dwattr $C$DW$294, DW_AT_name("SOC2")
    7719                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_SOC2")
    7720                      .dwattr $C$DW$294, DW_AT_bit_offset(0x0a)
    7721                      .dwattr $C$DW$294, DW_AT_bit_size(0x02)
    7722                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7723                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    7724              
    7725              $C$DW$295       .dwtag  DW_TAG_member
    7726                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$21)
    7727                      .dwattr $C$DW$295, DW_AT_name("SOC3")
    7728                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_SOC3")
    7729                      .dwattr $C$DW$295, DW_AT_bit_offset(0x08)
    7730                      .dwattr $C$DW$295, DW_AT_bit_size(0x02)
    7731                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  163

    7732                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    7733              
    7734              $C$DW$296       .dwtag  DW_TAG_member
    7735                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$21)
    7736                      .dwattr $C$DW$296, DW_AT_name("SOC4")
    7737                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_SOC4")
    7738                      .dwattr $C$DW$296, DW_AT_bit_offset(0x06)
    7739                      .dwattr $C$DW$296, DW_AT_bit_size(0x02)
    7740                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7741                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    7742              
    7743              $C$DW$297       .dwtag  DW_TAG_member
    7744                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$21)
    7745                      .dwattr $C$DW$297, DW_AT_name("SOC5")
    7746                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_SOC5")
    7747                      .dwattr $C$DW$297, DW_AT_bit_offset(0x04)
    7748                      .dwattr $C$DW$297, DW_AT_bit_size(0x02)
    7749                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7750                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    7751              
    7752              $C$DW$298       .dwtag  DW_TAG_member
    7753                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$21)
    7754                      .dwattr $C$DW$298, DW_AT_name("SOC6")
    7755                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_SOC6")
    7756                      .dwattr $C$DW$298, DW_AT_bit_offset(0x02)
    7757                      .dwattr $C$DW$298, DW_AT_bit_size(0x02)
    7758                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7759                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    7760              
    7761              $C$DW$299       .dwtag  DW_TAG_member
    7762                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$21)
    7763                      .dwattr $C$DW$299, DW_AT_name("SOC7")
    7764                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_SOC7")
    7765                      .dwattr $C$DW$299, DW_AT_bit_offset(0x00)
    7766                      .dwattr $C$DW$299, DW_AT_bit_size(0x02)
    7767                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7768                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    7769              
    7770                      .dwendtag $C$DW$T$43
    7771              
    7772              
    7773              $C$DW$T$44      .dwtag  DW_TAG_union_type
    7774                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTSOCSEL1_REG")
    7775                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    7776              $C$DW$300       .dwtag  DW_TAG_member
    7777                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$21)
    7778                      .dwattr $C$DW$300, DW_AT_name("all")
    7779                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_all")
    7780                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7781                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    7782              
    7783              $C$DW$301       .dwtag  DW_TAG_member
    7784                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$43)
    7785                      .dwattr $C$DW$301, DW_AT_name("bit")
    7786                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  164

    7787                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7788                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    7789              
    7790                      .dwendtag $C$DW$T$44
    7791              
    7792              
    7793              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    7794                      .dwattr $C$DW$T$45, DW_AT_name("ADCINTSOCSEL2_BITS")
    7795                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    7796              $C$DW$302       .dwtag  DW_TAG_member
    7797                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$21)
    7798                      .dwattr $C$DW$302, DW_AT_name("SOC8")
    7799                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_SOC8")
    7800                      .dwattr $C$DW$302, DW_AT_bit_offset(0x0e)
    7801                      .dwattr $C$DW$302, DW_AT_bit_size(0x02)
    7802                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7803                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    7804              
    7805              $C$DW$303       .dwtag  DW_TAG_member
    7806                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$21)
    7807                      .dwattr $C$DW$303, DW_AT_name("SOC9")
    7808                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_SOC9")
    7809                      .dwattr $C$DW$303, DW_AT_bit_offset(0x0c)
    7810                      .dwattr $C$DW$303, DW_AT_bit_size(0x02)
    7811                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7812                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    7813              
    7814              $C$DW$304       .dwtag  DW_TAG_member
    7815                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$21)
    7816                      .dwattr $C$DW$304, DW_AT_name("SOC10")
    7817                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_SOC10")
    7818                      .dwattr $C$DW$304, DW_AT_bit_offset(0x0a)
    7819                      .dwattr $C$DW$304, DW_AT_bit_size(0x02)
    7820                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7821                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    7822              
    7823              $C$DW$305       .dwtag  DW_TAG_member
    7824                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$21)
    7825                      .dwattr $C$DW$305, DW_AT_name("SOC11")
    7826                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_SOC11")
    7827                      .dwattr $C$DW$305, DW_AT_bit_offset(0x08)
    7828                      .dwattr $C$DW$305, DW_AT_bit_size(0x02)
    7829                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7830                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    7831              
    7832              $C$DW$306       .dwtag  DW_TAG_member
    7833                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$21)
    7834                      .dwattr $C$DW$306, DW_AT_name("SOC12")
    7835                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_SOC12")
    7836                      .dwattr $C$DW$306, DW_AT_bit_offset(0x06)
    7837                      .dwattr $C$DW$306, DW_AT_bit_size(0x02)
    7838                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7839                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    7840              
    7841              $C$DW$307       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless.asm                                                PAGE  165

    7842                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
    7843                      .dwattr $C$DW$307, DW_AT_name("SOC13")
    7844                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_SOC13")
    7845                      .dwattr $C$DW$307, DW_AT_bit_offset(0x04)
    7846                      .dwattr $C$DW$307, DW_AT_bit_size(0x02)
    7847                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7848                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    7849              
    7850              $C$DW$308       .dwtag  DW_TAG_member
    7851                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
    7852                      .dwattr $C$DW$308, DW_AT_name("SOC14")
    7853                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_SOC14")
    7854                      .dwattr $C$DW$308, DW_AT_bit_offset(0x02)
    7855                      .dwattr $C$DW$308, DW_AT_bit_size(0x02)
    7856                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7857                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    7858              
    7859              $C$DW$309       .dwtag  DW_TAG_member
    7860                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$21)
    7861                      .dwattr $C$DW$309, DW_AT_name("SOC15")
    7862                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_SOC15")
    7863                      .dwattr $C$DW$309, DW_AT_bit_offset(0x00)
    7864                      .dwattr $C$DW$309, DW_AT_bit_size(0x02)
    7865                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7866                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    7867              
    7868                      .dwendtag $C$DW$T$45
    7869              
    7870              
    7871              $C$DW$T$46      .dwtag  DW_TAG_union_type
    7872                      .dwattr $C$DW$T$46, DW_AT_name("ADCINTSOCSEL2_REG")
    7873                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    7874              $C$DW$310       .dwtag  DW_TAG_member
    7875                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$21)
    7876                      .dwattr $C$DW$310, DW_AT_name("all")
    7877                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_all")
    7878                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7879                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    7880              
    7881              $C$DW$311       .dwtag  DW_TAG_member
    7882                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$45)
    7883                      .dwattr $C$DW$311, DW_AT_name("bit")
    7884                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_bit")
    7885                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7886                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    7887              
    7888                      .dwendtag $C$DW$T$46
    7889              
    7890              
    7891              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    7892                      .dwattr $C$DW$T$47, DW_AT_name("ADCINT_BITS")
    7893                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
