TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                 Unix v15.12.1.LTS *
       3              ;* Date/Time created: Wed Jun 29 07:17:39 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../HVBLDC_Sensorless-DevInit_F2803x.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen Unix v15.12.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/kuotungtsai/controlSUITE/development_kits/HVMotorCtrl+PfcKit
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("FlashRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_FlashRegs")

     946              ;***************************************************************
     947              
     948 0000019f       _MemCopy:
     949                      .dwcfi  cfa_offset, -2
     950                      .dwcfi  save_reg_to_mem, 26, 0
     951 0000019f FE04          ADDB      SP,#4                 ; [CPU_U] 
     952                      .dwcfi  cfa_offset, -6
     953              $C$DW$34        .dwtag  DW_TAG_variable
     954                      .dwattr $C$DW$34, DW_AT_name("SourceAddr")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   21

     955                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_SourceAddr")
     956                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$147)
     957                      .dwattr $C$DW$34, DW_AT_location[DW_OP_breg20 -2]
     958              
     959              $C$DW$35        .dwtag  DW_TAG_variable
     960                      .dwattr $C$DW$35, DW_AT_name("SourceEndAddr")
     961                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_SourceEndAddr")
     962                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$147)
     963                      .dwattr $C$DW$35, DW_AT_location[DW_OP_breg20 -4]
     964              
     965 000001a0 A044          MOVL      *-SP[4],XAR5          ; [CPU_] |611| 
     966 000001a1 A842          MOVL      *-SP[2],XAR4          ; [CPU_] |611| 
     967                      .dwpsn  file "../HVBLDC_Sensorless-DevInit_F2803x.c",line 612,column 11,is_stmt,isa 0
     968 000001a2 0644          MOVL      ACC,*-SP[4]           ; [CPU_] |612| 
     969 000001a3 0F42          CMPL      ACC,*-SP[2]           ; [CPU_] |612| 
     970 000001a4 690C          B         $C$L9,LOS             ; [CPU_] |612| 
     971                      ; branchcc occurs ; [] |612| 
     972 000001a5       $C$L8:    
     973                      .dwpsn  file "../HVBLDC_Sensorless-DevInit_F2803x.c",line 614,column 8,is_stmt,isa 0
     974 000001a5 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |614| 
     975 000001a6 9284          MOV       AL,*XAR4++            ; [CPU_] |614| 
     976 000001a7 A842          MOVL      *-SP[2],XAR4          ; [CPU_] |614| 
     977 000001a8 8A48          MOVL      XAR4,*-SP[8]          ; [CPU_] |614| 
     978 000001a9 C4A4          MOVL      XAR6,XAR4             ; [CPU_] |614| 
     979 000001aa DE01          ADDB      XAR6,#1               ; [CPU_] |614| 
     980 000001ab C248          MOVL      *-SP[8],XAR6          ; [CPU_] |614| 
     981 000001ac 96C4          MOV       *+XAR4[0],AL          ; [CPU_] |614| 
     982                      .dwpsn  file "../HVBLDC_Sensorless-DevInit_F2803x.c",line 612,column 11,is_stmt,isa 0
     983 000001ad 0644          MOVL      ACC,*-SP[4]           ; [CPU_] |612| 
     984 000001ae 0F42          CMPL      ACC,*-SP[2]           ; [CPU_] |612| 
     985 000001af 66F6          B         $C$L8,HI              ; [CPU_] |612| 
     986                      ; branchcc occurs ; [] |612| 
     987                      .dwpsn  file "../HVBLDC_Sensorless-DevInit_F2803x.c",line 616,column 5,is_stmt,isa 0
     988 000001b0       $C$L9:    
     989                      .dwpsn  file "../HVBLDC_Sensorless-DevInit_F2803x.c",line 617,column 1,is_stmt,isa 0
     990 000001b0 FE84          SUBB      SP,#4                 ; [CPU_U] 
     991                      .dwcfi  cfa_offset, -2
     992              $C$DW$36        .dwtag  DW_TAG_TI_branch
     993                      .dwattr $C$DW$36, DW_AT_low_pc(0x00)
     994                      .dwattr $C$DW$36, DW_AT_TI_return
     995              
     996 000001b1 0006          LRETR     ; [CPU_] 
     997                      ; return occurs ; [] 
     998                      .dwattr $C$DW$30, DW_AT_TI_end_file("../HVBLDC_Sensorless-DevInit_F2803x.c")
     999                      .dwattr $C$DW$30, DW_AT_TI_end_line(0x269)
    1000                      .dwattr $C$DW$30, DW_AT_TI_end_column(0x01)
    1001                      .dwendentry
    1002                      .dwendtag $C$DW$30
    1003              
    1004              ;**************************************************************
    1005              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1006              ;**************************************************************
    1007                      .global _FlashRegs
    1008                      .global _PieCtrlRegs
    1009                      .global _SysCtrlRegs
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   22

    1010                      .global _GpioDataRegs
    1011                      .global _GpioCtrlRegs
    1012                      .global _PieVectTable
    1013              
    1014              ;***************************************************************
    1015              ;* TYPE INFORMATION                                            *
    1016              ;***************************************************************
    1017              
    1018              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1019                      .dwattr $C$DW$T$20, DW_AT_name("AIODAT_BITS")
    1020                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1021              $C$DW$37        .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
    1023                      .dwattr $C$DW$37, DW_AT_name("rsvd1")
    1024                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd1")
    1025                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0f)
    1026                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
    1027                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
    1029              
    1030              $C$DW$38        .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
    1032                      .dwattr $C$DW$38, DW_AT_name("rsvd2")
    1033                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd2")
    1034                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0e)
    1035                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
    1036                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
    1038              
    1039              $C$DW$39        .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
    1041                      .dwattr $C$DW$39, DW_AT_name("AIO2")
    1042                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_AIO2")
    1043                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0d)
    1044                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
    1045                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1046                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
    1047              
    1048              $C$DW$40        .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
    1050                      .dwattr $C$DW$40, DW_AT_name("rsvd3")
    1051                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd3")
    1052                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0c)
    1053                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
    1054                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1056              
    1057              $C$DW$41        .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
    1059                      .dwattr $C$DW$41, DW_AT_name("AIO4")
    1060                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_AIO4")
    1061                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0b)
    1062                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
    1063                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   23

    1065              
    1066              $C$DW$42        .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
    1068                      .dwattr $C$DW$42, DW_AT_name("rsvd4")
    1069                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd4")
    1070                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0a)
    1071                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
    1072                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1073                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1074              
    1075              $C$DW$43        .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
    1077                      .dwattr $C$DW$43, DW_AT_name("AIO6")
    1078                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_AIO6")
    1079                      .dwattr $C$DW$43, DW_AT_bit_offset(0x09)
    1080                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
    1081                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1082                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1083              
    1084              $C$DW$44        .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
    1086                      .dwattr $C$DW$44, DW_AT_name("rsvd5")
    1087                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_rsvd5")
    1088                      .dwattr $C$DW$44, DW_AT_bit_offset(0x08)
    1089                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
    1090                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1091                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1092              
    1093              $C$DW$45        .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
    1095                      .dwattr $C$DW$45, DW_AT_name("rsvd6")
    1096                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_rsvd6")
    1097                      .dwattr $C$DW$45, DW_AT_bit_offset(0x07)
    1098                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
    1099                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1100                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1101              
    1102              $C$DW$46        .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
    1104                      .dwattr $C$DW$46, DW_AT_name("rsvd7")
    1105                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_rsvd7")
    1106                      .dwattr $C$DW$46, DW_AT_bit_offset(0x06)
    1107                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
    1108                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1109                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1110              
    1111              $C$DW$47        .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
    1113                      .dwattr $C$DW$47, DW_AT_name("AIO10")
    1114                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_AIO10")
    1115                      .dwattr $C$DW$47, DW_AT_bit_offset(0x05)
    1116                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
    1117                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1118                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1119              
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   24

    1120              $C$DW$48        .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
    1122                      .dwattr $C$DW$48, DW_AT_name("rsvd8")
    1123                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_rsvd8")
    1124                      .dwattr $C$DW$48, DW_AT_bit_offset(0x04)
    1125                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
    1126                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1127                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1128              
    1129              $C$DW$49        .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
    1131                      .dwattr $C$DW$49, DW_AT_name("AIO12")
    1132                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_AIO12")
    1133                      .dwattr $C$DW$49, DW_AT_bit_offset(0x03)
    1134                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
    1135                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1137              
    1138              $C$DW$50        .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
    1140                      .dwattr $C$DW$50, DW_AT_name("rsvd9")
    1141                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd9")
    1142                      .dwattr $C$DW$50, DW_AT_bit_offset(0x02)
    1143                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
    1144                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1145                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1146              
    1147              $C$DW$51        .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
    1149                      .dwattr $C$DW$51, DW_AT_name("AIO14")
    1150                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_AIO14")
    1151                      .dwattr $C$DW$51, DW_AT_bit_offset(0x01)
    1152                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
    1153                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1154                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1155              
    1156              $C$DW$52        .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1158                      .dwattr $C$DW$52, DW_AT_name("rsvd10")
    1159                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_rsvd10")
    1160                      .dwattr $C$DW$52, DW_AT_bit_offset(0x00)
    1161                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
    1162                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1163                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1164              
    1165                      .dwendtag $C$DW$T$20
    1166              
    1167              
    1168              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1169                      .dwattr $C$DW$T$21, DW_AT_name("AIODAT_REG")
    1170                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1171              $C$DW$53        .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$53, DW_AT_name("all")
    1174                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   25

    1175                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1177              
    1178              $C$DW$54        .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$20)
    1180                      .dwattr $C$DW$54, DW_AT_name("bit")
    1181                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_bit")
    1182                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1184              
    1185                      .dwendtag $C$DW$T$21
    1186              
    1187              
    1188              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1189                      .dwattr $C$DW$T$22, DW_AT_name("AIO_BITS")
    1190                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1191              $C$DW$55        .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1193                      .dwattr $C$DW$55, DW_AT_name("rsvd1")
    1194                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd1")
    1195                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0e)
    1196                      .dwattr $C$DW$55, DW_AT_bit_size(0x02)
    1197                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1198                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1199              
    1200              $C$DW$56        .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$56, DW_AT_name("rsvd2")
    1203                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd2")
    1204                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0c)
    1205                      .dwattr $C$DW$56, DW_AT_bit_size(0x02)
    1206                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1208              
    1209              $C$DW$57        .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1211                      .dwattr $C$DW$57, DW_AT_name("AIO2")
    1212                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_AIO2")
    1213                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0a)
    1214                      .dwattr $C$DW$57, DW_AT_bit_size(0x02)
    1215                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1216                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1217              
    1218              $C$DW$58        .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1220                      .dwattr $C$DW$58, DW_AT_name("rsvd3")
    1221                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_rsvd3")
    1222                      .dwattr $C$DW$58, DW_AT_bit_offset(0x08)
    1223                      .dwattr $C$DW$58, DW_AT_bit_size(0x02)
    1224                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1226              
    1227              $C$DW$59        .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1229                      .dwattr $C$DW$59, DW_AT_name("AIO4")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   26

    1230                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_AIO4")
    1231                      .dwattr $C$DW$59, DW_AT_bit_offset(0x06)
    1232                      .dwattr $C$DW$59, DW_AT_bit_size(0x02)
    1233                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1235              
    1236              $C$DW$60        .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1238                      .dwattr $C$DW$60, DW_AT_name("rsvd4")
    1239                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd4")
    1240                      .dwattr $C$DW$60, DW_AT_bit_offset(0x04)
    1241                      .dwattr $C$DW$60, DW_AT_bit_size(0x02)
    1242                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1243                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1244              
    1245              $C$DW$61        .dwtag  DW_TAG_member
    1246                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1247                      .dwattr $C$DW$61, DW_AT_name("AIO6")
    1248                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_AIO6")
    1249                      .dwattr $C$DW$61, DW_AT_bit_offset(0x02)
    1250                      .dwattr $C$DW$61, DW_AT_bit_size(0x02)
    1251                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1252                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1253              
    1254              $C$DW$62        .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1256                      .dwattr $C$DW$62, DW_AT_name("rsvd5")
    1257                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_rsvd5")
    1258                      .dwattr $C$DW$62, DW_AT_bit_offset(0x00)
    1259                      .dwattr $C$DW$62, DW_AT_bit_size(0x02)
    1260                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1261                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1262              
    1263              $C$DW$63        .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1265                      .dwattr $C$DW$63, DW_AT_name("rsvd6")
    1266                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd6")
    1267                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0e)
    1268                      .dwattr $C$DW$63, DW_AT_bit_size(0x02)
    1269                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1270                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1271              
    1272              $C$DW$64        .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1274                      .dwattr $C$DW$64, DW_AT_name("rsvd7")
    1275                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_rsvd7")
    1276                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c)
    1277                      .dwattr $C$DW$64, DW_AT_bit_size(0x02)
    1278                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1279                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1280              
    1281              $C$DW$65        .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1283                      .dwattr $C$DW$65, DW_AT_name("AIO10")
    1284                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_AIO10")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   27

    1285                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0a)
    1286                      .dwattr $C$DW$65, DW_AT_bit_size(0x02)
    1287                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1288                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1289              
    1290              $C$DW$66        .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1292                      .dwattr $C$DW$66, DW_AT_name("rsvd8")
    1293                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_rsvd8")
    1294                      .dwattr $C$DW$66, DW_AT_bit_offset(0x08)
    1295                      .dwattr $C$DW$66, DW_AT_bit_size(0x02)
    1296                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1297                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1298              
    1299              $C$DW$67        .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$67, DW_AT_name("AIO12")
    1302                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_AIO12")
    1303                      .dwattr $C$DW$67, DW_AT_bit_offset(0x06)
    1304                      .dwattr $C$DW$67, DW_AT_bit_size(0x02)
    1305                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1306                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1307              
    1308              $C$DW$68        .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1310                      .dwattr $C$DW$68, DW_AT_name("rsvd9")
    1311                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd9")
    1312                      .dwattr $C$DW$68, DW_AT_bit_offset(0x04)
    1313                      .dwattr $C$DW$68, DW_AT_bit_size(0x02)
    1314                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1315                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1316              
    1317              $C$DW$69        .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1319                      .dwattr $C$DW$69, DW_AT_name("AIO14")
    1320                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_AIO14")
    1321                      .dwattr $C$DW$69, DW_AT_bit_offset(0x02)
    1322                      .dwattr $C$DW$69, DW_AT_bit_size(0x02)
    1323                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1324                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1325              
    1326              $C$DW$70        .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1328                      .dwattr $C$DW$70, DW_AT_name("rsvd10")
    1329                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_rsvd10")
    1330                      .dwattr $C$DW$70, DW_AT_bit_offset(0x00)
    1331                      .dwattr $C$DW$70, DW_AT_bit_size(0x02)
    1332                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1333                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1334              
    1335                      .dwendtag $C$DW$T$22
    1336              
    1337              
    1338              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1339                      .dwattr $C$DW$T$24, DW_AT_name("AIO_REG")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   28

    1340                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1341              $C$DW$71        .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$23)
    1343                      .dwattr $C$DW$71, DW_AT_name("all")
    1344                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_all")
    1345                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1347              
    1348              $C$DW$72        .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$22)
    1350                      .dwattr $C$DW$72, DW_AT_name("bit")
    1351                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_bit")
    1352                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1354              
    1355                      .dwendtag $C$DW$T$24
    1356              
    1357              
    1358              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1359                      .dwattr $C$DW$T$25, DW_AT_name("CLKCTL_BITS")
    1360                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1361              $C$DW$73        .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1363                      .dwattr $C$DW$73, DW_AT_name("OSCCLKSRCSEL")
    1364                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    1365                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0f)
    1366                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1367                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1369              
    1370              $C$DW$74        .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1372                      .dwattr $C$DW$74, DW_AT_name("OSCCLKSRC2SEL")
    1373                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_OSCCLKSRC2SEL")
    1374                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0e)
    1375                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1376                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1377                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1378              
    1379              $C$DW$75        .dwtag  DW_TAG_member
    1380                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1381                      .dwattr $C$DW$75, DW_AT_name("WDCLKSRCSEL")
    1382                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_WDCLKSRCSEL")
    1383                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0d)
    1384                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1385                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1386                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1387              
    1388              $C$DW$76        .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1390                      .dwattr $C$DW$76, DW_AT_name("TMR2CLKSRCSEL")
    1391                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_TMR2CLKSRCSEL")
    1392                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0b)
    1393                      .dwattr $C$DW$76, DW_AT_bit_size(0x02)
    1394                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   29

    1395                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1396              
    1397              $C$DW$77        .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1399                      .dwattr $C$DW$77, DW_AT_name("TMR2CLKPRESCALE")
    1400                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_TMR2CLKPRESCALE")
    1401                      .dwattr $C$DW$77, DW_AT_bit_offset(0x08)
    1402                      .dwattr $C$DW$77, DW_AT_bit_size(0x03)
    1403                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1405              
    1406              $C$DW$78        .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1408                      .dwattr $C$DW$78, DW_AT_name("INTOSC1OFF")
    1409                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_INTOSC1OFF")
    1410                      .dwattr $C$DW$78, DW_AT_bit_offset(0x07)
    1411                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1412                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1414              
    1415              $C$DW$79        .dwtag  DW_TAG_member
    1416                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1417                      .dwattr $C$DW$79, DW_AT_name("INTOSC1HALTI")
    1418                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_INTOSC1HALTI")
    1419                      .dwattr $C$DW$79, DW_AT_bit_offset(0x06)
    1420                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1421                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1422                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1423              
    1424              $C$DW$80        .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1426                      .dwattr $C$DW$80, DW_AT_name("INTOSC2OFF")
    1427                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_INTOSC2OFF")
    1428                      .dwattr $C$DW$80, DW_AT_bit_offset(0x05)
    1429                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1430                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1431                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1432              
    1433              $C$DW$81        .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1435                      .dwattr $C$DW$81, DW_AT_name("INTOSC2HALTI")
    1436                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_INTOSC2HALTI")
    1437                      .dwattr $C$DW$81, DW_AT_bit_offset(0x04)
    1438                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1439                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1441              
    1442              $C$DW$82        .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1444                      .dwattr $C$DW$82, DW_AT_name("WDHALTI")
    1445                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_WDHALTI")
    1446                      .dwattr $C$DW$82, DW_AT_bit_offset(0x03)
    1447                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1448                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1449                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   30

    1450              
    1451              $C$DW$83        .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1453                      .dwattr $C$DW$83, DW_AT_name("XCLKINOFF")
    1454                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_XCLKINOFF")
    1455                      .dwattr $C$DW$83, DW_AT_bit_offset(0x02)
    1456                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1457                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1459              
    1460              $C$DW$84        .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1462                      .dwattr $C$DW$84, DW_AT_name("XTALOSCOFF")
    1463                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_XTALOSCOFF")
    1464                      .dwattr $C$DW$84, DW_AT_bit_offset(0x01)
    1465                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1466                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1468              
    1469              $C$DW$85        .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1471                      .dwattr $C$DW$85, DW_AT_name("NMIRESETSEL")
    1472                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_NMIRESETSEL")
    1473                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
    1474                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1475                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1477              
    1478                      .dwendtag $C$DW$T$25
    1479              
    1480              
    1481              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1482                      .dwattr $C$DW$T$26, DW_AT_name("CLKCTL_REG")
    1483                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1484              $C$DW$86        .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$86, DW_AT_name("all")
    1487                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
    1488                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1489                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1490              
    1491              $C$DW$87        .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$25)
    1493                      .dwattr $C$DW$87, DW_AT_name("bit")
    1494                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
    1495                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1496                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1497              
    1498                      .dwendtag $C$DW$T$26
    1499              
    1500              
    1501              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1502                      .dwattr $C$DW$T$27, DW_AT_name("FACTIVEWAIT_BITS")
    1503                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1504              $C$DW$88        .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   31

    1505                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1506                      .dwattr $C$DW$88, DW_AT_name("ACTIVEWAIT")
    1507                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ACTIVEWAIT")
    1508                      .dwattr $C$DW$88, DW_AT_bit_offset(0x07)
    1509                      .dwattr $C$DW$88, DW_AT_bit_size(0x09)
    1510                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1511                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1512              
    1513              $C$DW$89        .dwtag  DW_TAG_member
    1514                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1515                      .dwattr $C$DW$89, DW_AT_name("rsvd")
    1516                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd")
    1517                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
    1518                      .dwattr $C$DW$89, DW_AT_bit_size(0x07)
    1519                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1520                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1521              
    1522                      .dwendtag $C$DW$T$27
    1523              
    1524              
    1525              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1526                      .dwattr $C$DW$T$28, DW_AT_name("FACTIVEWAIT_REG")
    1527                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1528              $C$DW$90        .dwtag  DW_TAG_member
    1529                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1530                      .dwattr $C$DW$90, DW_AT_name("all")
    1531                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
    1532                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1533                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1534              
    1535              $C$DW$91        .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$27)
    1537                      .dwattr $C$DW$91, DW_AT_name("bit")
    1538                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
    1539                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1541              
    1542                      .dwendtag $C$DW$T$28
    1543              
    1544              
    1545              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1546                      .dwattr $C$DW$T$29, DW_AT_name("FBANKWAIT_BITS")
    1547                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1548              $C$DW$92        .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1550                      .dwattr $C$DW$92, DW_AT_name("RANDWAIT")
    1551                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_RANDWAIT")
    1552                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0c)
    1553                      .dwattr $C$DW$92, DW_AT_bit_size(0x04)
    1554                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1555                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1556              
    1557              $C$DW$93        .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1559                      .dwattr $C$DW$93, DW_AT_name("rsvd1")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   32

    1560                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd1")
    1561                      .dwattr $C$DW$93, DW_AT_bit_offset(0x08)
    1562                      .dwattr $C$DW$93, DW_AT_bit_size(0x04)
    1563                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1564                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1565              
    1566              $C$DW$94        .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1568                      .dwattr $C$DW$94, DW_AT_name("PAGEWAIT")
    1569                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_PAGEWAIT")
    1570                      .dwattr $C$DW$94, DW_AT_bit_offset(0x04)
    1571                      .dwattr $C$DW$94, DW_AT_bit_size(0x04)
    1572                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1573                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1574              
    1575              $C$DW$95        .dwtag  DW_TAG_member
    1576                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1577                      .dwattr $C$DW$95, DW_AT_name("rsvd2")
    1578                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd2")
    1579                      .dwattr $C$DW$95, DW_AT_bit_offset(0x00)
    1580                      .dwattr $C$DW$95, DW_AT_bit_size(0x04)
    1581                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1583              
    1584                      .dwendtag $C$DW$T$29
    1585              
    1586              
    1587              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1588                      .dwattr $C$DW$T$30, DW_AT_name("FBANKWAIT_REG")
    1589                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1590              $C$DW$96        .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1592                      .dwattr $C$DW$96, DW_AT_name("all")
    1593                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_all")
    1594                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1595                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1596              
    1597              $C$DW$97        .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$29)
    1599                      .dwattr $C$DW$97, DW_AT_name("bit")
    1600                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_bit")
    1601                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1603              
    1604                      .dwendtag $C$DW$T$30
    1605              
    1606              
    1607              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1608                      .dwattr $C$DW$T$31, DW_AT_name("FLASH_REGS")
    1609                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
    1610              $C$DW$98        .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$33)
    1612                      .dwattr $C$DW$98, DW_AT_name("FOPT")
    1613                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_FOPT")
    1614                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   33

    1615                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1616              
    1617              $C$DW$99        .dwtag  DW_TAG_member
    1618                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1619                      .dwattr $C$DW$99, DW_AT_name("rsvd1")
    1620                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd1")
    1621                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1622                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1623              
    1624              $C$DW$100       .dwtag  DW_TAG_member
    1625                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$37)
    1626                      .dwattr $C$DW$100, DW_AT_name("FPWR")
    1627                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_FPWR")
    1628                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1629                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1630              
    1631              $C$DW$101       .dwtag  DW_TAG_member
    1632                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$39)
    1633                      .dwattr $C$DW$101, DW_AT_name("FSTATUS")
    1634                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_FSTATUS")
    1635                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1636                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1637              
    1638              $C$DW$102       .dwtag  DW_TAG_member
    1639                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$41)
    1640                      .dwattr $C$DW$102, DW_AT_name("FSTDBYWAIT")
    1641                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    1642                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1643                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1644              
    1645              $C$DW$103       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$28)
    1647                      .dwattr $C$DW$103, DW_AT_name("FACTIVEWAIT")
    1648                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    1649                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1650                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1651              
    1652              $C$DW$104       .dwtag  DW_TAG_member
    1653                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$30)
    1654                      .dwattr $C$DW$104, DW_AT_name("FBANKWAIT")
    1655                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_FBANKWAIT")
    1656                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1657                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1658              
    1659              $C$DW$105       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$35)
    1661                      .dwattr $C$DW$105, DW_AT_name("FOTPWAIT")
    1662                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_FOTPWAIT")
    1663                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1664                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1665              
    1666                      .dwendtag $C$DW$T$31
    1667              
    1668              $C$DW$106       .dwtag  DW_TAG_TI_far_type
    1669                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   34

    1670              
    1671              $C$DW$T$106     .dwtag  DW_TAG_volatile_type
    1672                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$106)
    1673              
    1674              
    1675              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1676                      .dwattr $C$DW$T$32, DW_AT_name("FOPT_BITS")
    1677                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1678              $C$DW$107       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1680                      .dwattr $C$DW$107, DW_AT_name("ENPIPE")
    1681                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_ENPIPE")
    1682                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0f)
    1683                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1684                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1685                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1686              
    1687              $C$DW$108       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1689                      .dwattr $C$DW$108, DW_AT_name("rsvd")
    1690                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_rsvd")
    1691                      .dwattr $C$DW$108, DW_AT_bit_offset(0x00)
    1692                      .dwattr $C$DW$108, DW_AT_bit_size(0x0f)
    1693                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1694                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1695              
    1696                      .dwendtag $C$DW$T$32
    1697              
    1698              
    1699              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1700                      .dwattr $C$DW$T$33, DW_AT_name("FOPT_REG")
    1701                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1702              $C$DW$109       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1704                      .dwattr $C$DW$109, DW_AT_name("all")
    1705                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_all")
    1706                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1707                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1708              
    1709              $C$DW$110       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$32)
    1711                      .dwattr $C$DW$110, DW_AT_name("bit")
    1712                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_bit")
    1713                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1715              
    1716                      .dwendtag $C$DW$T$33
    1717              
    1718              
    1719              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1720                      .dwattr $C$DW$T$34, DW_AT_name("FOTPWAIT_BITS")
    1721                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1722              $C$DW$111       .dwtag  DW_TAG_member
    1723                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1724                      .dwattr $C$DW$111, DW_AT_name("OTPWAIT")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   35

    1725                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_OTPWAIT")
    1726                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0b)
    1727                      .dwattr $C$DW$111, DW_AT_bit_size(0x05)
    1728                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1729                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1730              
    1731              $C$DW$112       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1733                      .dwattr $C$DW$112, DW_AT_name("rsvd")
    1734                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd")
    1735                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    1736                      .dwattr $C$DW$112, DW_AT_bit_size(0x0b)
    1737                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1738                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1739              
    1740                      .dwendtag $C$DW$T$34
    1741              
    1742              
    1743              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1744                      .dwattr $C$DW$T$35, DW_AT_name("FOTPWAIT_REG")
    1745                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1746              $C$DW$113       .dwtag  DW_TAG_member
    1747                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1748                      .dwattr $C$DW$113, DW_AT_name("all")
    1749                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
    1750                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1751                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1752              
    1753              $C$DW$114       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$34)
    1755                      .dwattr $C$DW$114, DW_AT_name("bit")
    1756                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
    1757                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1759              
    1760                      .dwendtag $C$DW$T$35
    1761              
    1762              
    1763              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1764                      .dwattr $C$DW$T$36, DW_AT_name("FPWR_BITS")
    1765                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1766              $C$DW$115       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1768                      .dwattr $C$DW$115, DW_AT_name("PWR")
    1769                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_PWR")
    1770                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0e)
    1771                      .dwattr $C$DW$115, DW_AT_bit_size(0x02)
    1772                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1773                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1774              
    1775              $C$DW$116       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1777                      .dwattr $C$DW$116, DW_AT_name("rsvd")
    1778                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd")
    1779                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   36

    1780                      .dwattr $C$DW$116, DW_AT_bit_size(0x0e)
    1781                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1782                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1783              
    1784                      .dwendtag $C$DW$T$36
    1785              
    1786              
    1787              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1788                      .dwattr $C$DW$T$37, DW_AT_name("FPWR_REG")
    1789                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1790              $C$DW$117       .dwtag  DW_TAG_member
    1791                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1792                      .dwattr $C$DW$117, DW_AT_name("all")
    1793                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_all")
    1794                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1795                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1796              
    1797              $C$DW$118       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$36)
    1799                      .dwattr $C$DW$118, DW_AT_name("bit")
    1800                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bit")
    1801                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1802                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1803              
    1804                      .dwendtag $C$DW$T$37
    1805              
    1806              
    1807              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1808                      .dwattr $C$DW$T$38, DW_AT_name("FSTATUS_BITS")
    1809                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1810              $C$DW$119       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1812                      .dwattr $C$DW$119, DW_AT_name("PWRS")
    1813                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_PWRS")
    1814                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0e)
    1815                      .dwattr $C$DW$119, DW_AT_bit_size(0x02)
    1816                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1817                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1818              
    1819              $C$DW$120       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1821                      .dwattr $C$DW$120, DW_AT_name("STDBYWAITS")
    1822                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_STDBYWAITS")
    1823                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0d)
    1824                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1825                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1826                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1827              
    1828              $C$DW$121       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1830                      .dwattr $C$DW$121, DW_AT_name("ACTIVEWAITS")
    1831                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_ACTIVEWAITS")
    1832                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0c)
    1833                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1834                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   37

    1835                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1836              
    1837              $C$DW$122       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1839                      .dwattr $C$DW$122, DW_AT_name("rsvd1")
    1840                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd1")
    1841                      .dwattr $C$DW$122, DW_AT_bit_offset(0x08)
    1842                      .dwattr $C$DW$122, DW_AT_bit_size(0x04)
    1843                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1844                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1845              
    1846              $C$DW$123       .dwtag  DW_TAG_member
    1847                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1848                      .dwattr $C$DW$123, DW_AT_name("V3STAT")
    1849                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_V3STAT")
    1850                      .dwattr $C$DW$123, DW_AT_bit_offset(0x07)
    1851                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1852                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1853                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1854              
    1855              $C$DW$124       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1857                      .dwattr $C$DW$124, DW_AT_name("rsvd2")
    1858                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd2")
    1859                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    1860                      .dwattr $C$DW$124, DW_AT_bit_size(0x07)
    1861                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1862                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1863              
    1864                      .dwendtag $C$DW$T$38
    1865              
    1866              
    1867              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1868                      .dwattr $C$DW$T$39, DW_AT_name("FSTATUS_REG")
    1869                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1870              $C$DW$125       .dwtag  DW_TAG_member
    1871                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1872                      .dwattr $C$DW$125, DW_AT_name("all")
    1873                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    1874                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1875                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1876              
    1877              $C$DW$126       .dwtag  DW_TAG_member
    1878                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$38)
    1879                      .dwattr $C$DW$126, DW_AT_name("bit")
    1880                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    1881                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1882                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1883              
    1884                      .dwendtag $C$DW$T$39
    1885              
    1886              
    1887              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1888                      .dwattr $C$DW$T$40, DW_AT_name("FSTDBYWAIT_BITS")
    1889                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   38

    1890              $C$DW$127       .dwtag  DW_TAG_member
    1891                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1892                      .dwattr $C$DW$127, DW_AT_name("STDBYWAIT")
    1893                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_STDBYWAIT")
    1894                      .dwattr $C$DW$127, DW_AT_bit_offset(0x07)
    1895                      .dwattr $C$DW$127, DW_AT_bit_size(0x09)
    1896                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1897                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1898              
    1899              $C$DW$128       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1901                      .dwattr $C$DW$128, DW_AT_name("rsvd")
    1902                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd")
    1903                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00)
    1904                      .dwattr $C$DW$128, DW_AT_bit_size(0x07)
    1905                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1906                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1907              
    1908                      .dwendtag $C$DW$T$40
    1909              
    1910              
    1911              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1912                      .dwattr $C$DW$T$41, DW_AT_name("FSTDBYWAIT_REG")
    1913                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1914              $C$DW$129       .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1916                      .dwattr $C$DW$129, DW_AT_name("all")
    1917                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_all")
    1918                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1919                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1920              
    1921              $C$DW$130       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$40)
    1923                      .dwattr $C$DW$130, DW_AT_name("bit")
    1924                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bit")
    1925                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1926                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1927              
    1928                      .dwendtag $C$DW$T$41
    1929              
    1930              
    1931              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1932                      .dwattr $C$DW$T$42, DW_AT_name("GPA1_BITS")
    1933                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    1934              $C$DW$131       .dwtag  DW_TAG_member
    1935                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1936                      .dwattr $C$DW$131, DW_AT_name("GPIO0")
    1937                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO0")
    1938                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0e)
    1939                      .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    1940                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1941                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1942              
    1943              $C$DW$132       .dwtag  DW_TAG_member
    1944                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   39

    1945                      .dwattr $C$DW$132, DW_AT_name("GPIO1")
    1946                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO1")
    1947                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0c)
    1948                      .dwattr $C$DW$132, DW_AT_bit_size(0x02)
    1949                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1950                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1951              
    1952              $C$DW$133       .dwtag  DW_TAG_member
    1953                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1954                      .dwattr $C$DW$133, DW_AT_name("GPIO2")
    1955                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO2")
    1956                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0a)
    1957                      .dwattr $C$DW$133, DW_AT_bit_size(0x02)
    1958                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1959                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1960              
    1961              $C$DW$134       .dwtag  DW_TAG_member
    1962                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1963                      .dwattr $C$DW$134, DW_AT_name("GPIO3")
    1964                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO3")
    1965                      .dwattr $C$DW$134, DW_AT_bit_offset(0x08)
    1966                      .dwattr $C$DW$134, DW_AT_bit_size(0x02)
    1967                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1968                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1969              
    1970              $C$DW$135       .dwtag  DW_TAG_member
    1971                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1972                      .dwattr $C$DW$135, DW_AT_name("GPIO4")
    1973                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO4")
    1974                      .dwattr $C$DW$135, DW_AT_bit_offset(0x06)
    1975                      .dwattr $C$DW$135, DW_AT_bit_size(0x02)
    1976                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1977                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1978              
    1979              $C$DW$136       .dwtag  DW_TAG_member
    1980                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1981                      .dwattr $C$DW$136, DW_AT_name("GPIO5")
    1982                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO5")
    1983                      .dwattr $C$DW$136, DW_AT_bit_offset(0x04)
    1984                      .dwattr $C$DW$136, DW_AT_bit_size(0x02)
    1985                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1986                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1987              
    1988              $C$DW$137       .dwtag  DW_TAG_member
    1989                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1990                      .dwattr $C$DW$137, DW_AT_name("GPIO6")
    1991                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO6")
    1992                      .dwattr $C$DW$137, DW_AT_bit_offset(0x02)
    1993                      .dwattr $C$DW$137, DW_AT_bit_size(0x02)
    1994                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1995                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1996              
    1997              $C$DW$138       .dwtag  DW_TAG_member
    1998                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1999                      .dwattr $C$DW$138, DW_AT_name("GPIO7")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   40

    2000                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO7")
    2001                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00)
    2002                      .dwattr $C$DW$138, DW_AT_bit_size(0x02)
    2003                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2004                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2005              
    2006              $C$DW$139       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2008                      .dwattr $C$DW$139, DW_AT_name("GPIO8")
    2009                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO8")
    2010                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0e)
    2011                      .dwattr $C$DW$139, DW_AT_bit_size(0x02)
    2012                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2013                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2014              
    2015              $C$DW$140       .dwtag  DW_TAG_member
    2016                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2017                      .dwattr $C$DW$140, DW_AT_name("GPIO9")
    2018                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO9")
    2019                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0c)
    2020                      .dwattr $C$DW$140, DW_AT_bit_size(0x02)
    2021                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2022                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2023              
    2024              $C$DW$141       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2026                      .dwattr $C$DW$141, DW_AT_name("GPIO10")
    2027                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO10")
    2028                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0a)
    2029                      .dwattr $C$DW$141, DW_AT_bit_size(0x02)
    2030                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2031                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2032              
    2033              $C$DW$142       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2035                      .dwattr $C$DW$142, DW_AT_name("GPIO11")
    2036                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO11")
    2037                      .dwattr $C$DW$142, DW_AT_bit_offset(0x08)
    2038                      .dwattr $C$DW$142, DW_AT_bit_size(0x02)
    2039                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2040                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2041              
    2042              $C$DW$143       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2044                      .dwattr $C$DW$143, DW_AT_name("GPIO12")
    2045                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO12")
    2046                      .dwattr $C$DW$143, DW_AT_bit_offset(0x06)
    2047                      .dwattr $C$DW$143, DW_AT_bit_size(0x02)
    2048                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2049                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2050              
    2051              $C$DW$144       .dwtag  DW_TAG_member
    2052                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2053                      .dwattr $C$DW$144, DW_AT_name("GPIO13")
    2054                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO13")
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   41

    2055                      .dwattr $C$DW$144, DW_AT_bit_offset(0x04)
    2056                      .dwattr $C$DW$144, DW_AT_bit_size(0x02)
    2057                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2058                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2059              
    2060              $C$DW$145       .dwtag  DW_TAG_member
    2061                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2062                      .dwattr $C$DW$145, DW_AT_name("GPIO14")
    2063                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO14")
    2064                      .dwattr $C$DW$145, DW_AT_bit_offset(0x02)
    2065                      .dwattr $C$DW$145, DW_AT_bit_size(0x02)
    2066                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2067                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2068              
    2069              $C$DW$146       .dwtag  DW_TAG_member
    2070                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2071                      .dwattr $C$DW$146, DW_AT_name("GPIO15")
    2072                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO15")
    2073                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    2074                      .dwattr $C$DW$146, DW_AT_bit_size(0x02)
    2075                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2076                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2077              
    2078                      .dwendtag $C$DW$T$42
    2079              
    2080              
    2081              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2082                      .dwattr $C$DW$T$43, DW_AT_name("GPA1_REG")
    2083                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2084              $C$DW$147       .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$23)
    2086                      .dwattr $C$DW$147, DW_AT_name("all")
    2087                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_all")
    2088                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2089                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2090              
    2091              $C$DW$148       .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$42)
    2093                      .dwattr $C$DW$148, DW_AT_name("bit")
    2094                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_bit")
    2095                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2096                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2097              
    2098                      .dwendtag $C$DW$T$43
    2099              
    2100              
    2101              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2102                      .dwattr $C$DW$T$44, DW_AT_name("GPA2_BITS")
    2103                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2104              $C$DW$149       .dwtag  DW_TAG_member
    2105                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2106                      .dwattr $C$DW$149, DW_AT_name("GPIO16")
    2107                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO16")
    2108                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0e)
    2109                      .dwattr $C$DW$149, DW_AT_bit_size(0x02)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   42

    2110                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2111                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2112              
    2113              $C$DW$150       .dwtag  DW_TAG_member
    2114                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2115                      .dwattr $C$DW$150, DW_AT_name("GPIO17")
    2116                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO17")
    2117                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0c)
    2118                      .dwattr $C$DW$150, DW_AT_bit_size(0x02)
    2119                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2120                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2121              
    2122              $C$DW$151       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2124                      .dwattr $C$DW$151, DW_AT_name("GPIO18")
    2125                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO18")
    2126                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0a)
    2127                      .dwattr $C$DW$151, DW_AT_bit_size(0x02)
    2128                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2129                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2130              
    2131              $C$DW$152       .dwtag  DW_TAG_member
    2132                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2133                      .dwattr $C$DW$152, DW_AT_name("GPIO19")
    2134                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO19")
    2135                      .dwattr $C$DW$152, DW_AT_bit_offset(0x08)
    2136                      .dwattr $C$DW$152, DW_AT_bit_size(0x02)
    2137                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2138                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2139              
    2140              $C$DW$153       .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2142                      .dwattr $C$DW$153, DW_AT_name("GPIO20")
    2143                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO20")
    2144                      .dwattr $C$DW$153, DW_AT_bit_offset(0x06)
    2145                      .dwattr $C$DW$153, DW_AT_bit_size(0x02)
    2146                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2147                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2148              
    2149              $C$DW$154       .dwtag  DW_TAG_member
    2150                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2151                      .dwattr $C$DW$154, DW_AT_name("GPIO21")
    2152                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO21")
    2153                      .dwattr $C$DW$154, DW_AT_bit_offset(0x04)
    2154                      .dwattr $C$DW$154, DW_AT_bit_size(0x02)
    2155                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2156                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2157              
    2158              $C$DW$155       .dwtag  DW_TAG_member
    2159                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2160                      .dwattr $C$DW$155, DW_AT_name("GPIO22")
    2161                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO22")
    2162                      .dwattr $C$DW$155, DW_AT_bit_offset(0x02)
    2163                      .dwattr $C$DW$155, DW_AT_bit_size(0x02)
    2164                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   43

    2165                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2166              
    2167              $C$DW$156       .dwtag  DW_TAG_member
    2168                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2169                      .dwattr $C$DW$156, DW_AT_name("GPIO23")
    2170                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO23")
    2171                      .dwattr $C$DW$156, DW_AT_bit_offset(0x00)
    2172                      .dwattr $C$DW$156, DW_AT_bit_size(0x02)
    2173                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2174                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2175              
    2176              $C$DW$157       .dwtag  DW_TAG_member
    2177                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2178                      .dwattr $C$DW$157, DW_AT_name("GPIO24")
    2179                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO24")
    2180                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0e)
    2181                      .dwattr $C$DW$157, DW_AT_bit_size(0x02)
    2182                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2183                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2184              
    2185              $C$DW$158       .dwtag  DW_TAG_member
    2186                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2187                      .dwattr $C$DW$158, DW_AT_name("GPIO25")
    2188                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO25")
    2189                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0c)
    2190                      .dwattr $C$DW$158, DW_AT_bit_size(0x02)
    2191                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2192                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2193              
    2194              $C$DW$159       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2196                      .dwattr $C$DW$159, DW_AT_name("GPIO26")
    2197                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO26")
    2198                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0a)
    2199                      .dwattr $C$DW$159, DW_AT_bit_size(0x02)
    2200                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2201                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2202              
    2203              $C$DW$160       .dwtag  DW_TAG_member
    2204                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2205                      .dwattr $C$DW$160, DW_AT_name("GPIO27")
    2206                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO27")
    2207                      .dwattr $C$DW$160, DW_AT_bit_offset(0x08)
    2208                      .dwattr $C$DW$160, DW_AT_bit_size(0x02)
    2209                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2210                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2211              
    2212              $C$DW$161       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2214                      .dwattr $C$DW$161, DW_AT_name("GPIO28")
    2215                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO28")
    2216                      .dwattr $C$DW$161, DW_AT_bit_offset(0x06)
    2217                      .dwattr $C$DW$161, DW_AT_bit_size(0x02)
    2218                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2219                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   44

    2220              
    2221              $C$DW$162       .dwtag  DW_TAG_member
    2222                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2223                      .dwattr $C$DW$162, DW_AT_name("GPIO29")
    2224                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO29")
    2225                      .dwattr $C$DW$162, DW_AT_bit_offset(0x04)
    2226                      .dwattr $C$DW$162, DW_AT_bit_size(0x02)
    2227                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2228                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2229              
    2230              $C$DW$163       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2232                      .dwattr $C$DW$163, DW_AT_name("GPIO30")
    2233                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO30")
    2234                      .dwattr $C$DW$163, DW_AT_bit_offset(0x02)
    2235                      .dwattr $C$DW$163, DW_AT_bit_size(0x02)
    2236                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2237                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2238              
    2239              $C$DW$164       .dwtag  DW_TAG_member
    2240                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2241                      .dwattr $C$DW$164, DW_AT_name("GPIO31")
    2242                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO31")
    2243                      .dwattr $C$DW$164, DW_AT_bit_offset(0x00)
    2244                      .dwattr $C$DW$164, DW_AT_bit_size(0x02)
    2245                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2246                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2247              
    2248                      .dwendtag $C$DW$T$44
    2249              
    2250              
    2251              $C$DW$T$45      .dwtag  DW_TAG_union_type
    2252                      .dwattr $C$DW$T$45, DW_AT_name("GPA2_REG")
    2253                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2254              $C$DW$165       .dwtag  DW_TAG_member
    2255                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$23)
    2256                      .dwattr $C$DW$165, DW_AT_name("all")
    2257                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_all")
    2258                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2259                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2260              
    2261              $C$DW$166       .dwtag  DW_TAG_member
    2262                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$44)
    2263                      .dwattr $C$DW$166, DW_AT_name("bit")
    2264                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_bit")
    2265                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2266                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2267              
    2268                      .dwendtag $C$DW$T$45
    2269              
    2270              
    2271              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2272                      .dwattr $C$DW$T$46, DW_AT_name("GPACTRL_BITS")
    2273                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2274              $C$DW$167       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.1 Wed Jun 29 07:17:39 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
HVBLDC_Sensorless-DevInit_F2803x.asm                                 PAGE   45

    2275                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2276                      .dwattr $C$DW$167, DW_AT_name("QUALPRD0")
    2277                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_QUALPRD0")
    2278                      .dwattr $C$DW$167, DW_AT_bit_offset(0x08)
    2279                      .dwattr $C$DW$167, DW_AT_bit_size(0x08)
    2280                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2281                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2282              
    2283              $C$DW$168       .dwtag  DW_TAG_member
    2284                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2285                      .dwattr $C$DW$168, DW_AT_name("QUALPRD1")
    2286                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_QUALPRD1")
    2287                      .dwattr $C$DW$168, DW_AT_bit_offset(0x00)
    2288                      .dwattr $C$DW$168, DW_AT_bit_size(0x08)
    2289                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2290                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2291              
    2292              $C$DW$169       .dwtag  DW_TAG_member
    2293                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2294                      .dwattr $C$DW$169, DW_AT_name("QUALPRD2")
    2295                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_QUALPRD2")
    2296                      .dwattr $C$DW$169, DW_AT_bit_offset(0x08)
    2297                      .dwattr $C$DW$169, DW_AT_bit_size(0x08)
    2298                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2299                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2300              
    2301              $C$DW$170       .dwtag  DW_TAG_member
    2302                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2303                      .dwattr $C$DW$170, DW_AT_name("QUALPRD3")
    2304                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_QUALPRD3")
    2305                      .dwattr $C$DW$170, DW_AT_bit_offset(0x00)
    2306                      .dwattr $C$DW$170, DW_AT_bit_size(0x08)
    2307                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2308                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2309              
    2310                      .dwendtag $C$DW$T$46
    2311              
    2312              
    2313              $C$DW$T$47      .dwtag  DW_TAG_union_type
    2314                      .dwattr $C$DW$T$47, DW_AT_name("GPACTRL_REG")
    2315                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2316              $C$DW$171       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$23)
    2318                      .dwattr $C$DW$171, DW_AT_name("all")
    2319                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_all")
    2320                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2321                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
